NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* XOTUNEFAILED @Bit 6 : Write '1' to enable interrupt for event XOTUNEFAILED */
  #define CLOCK_INTENSET_XOTUNEFAILED_Pos (6UL)      /*!< Position of XOTUNEFAILED field.                                      */
  #define CLOCK_INTENSET_XOTUNEFAILED_Msk (0x1UL << CLOCK_INTENSET_XOTUNEFAILED_Pos) /*!< Bit mask of XOTUNEFAILED field.      */
  #define CLOCK_INTENSET_XOTUNEFAILED_Min (0x0UL)    /*!< Min enumerator value of XOTUNEFAILED field.                          */
  #define CLOCK_INTENSET_XOTUNEFAILED_Max (0x1UL)    /*!< Max enumerator value of XOTUNEFAILED field.                          */
  #define CLOCK_INTENSET_XOTUNEFAILED_Set (0x1UL)    /*!< Enable                                                               */
  #define CLOCK_INTENSET_XOTUNEFAILED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CLOCK_INTENSET_XOTUNEFAILED_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* CLOCK_INTENCLR: Disable interrupt */
  #define CLOCK_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* XOSTARTED @Bit 0 : Write '1' to disable interrupt for event XOSTARTED */
  #define CLOCK_INTENCLR_XOSTARTED_Pos (0UL)         /*!< Position of XOSTARTED field.                                         */
  #define CLOCK_INTENCLR_XOSTARTED_Msk (0x1UL << CLOCK_INTENCLR_XOSTARTED_Pos) /*!< Bit mask of XOSTARTED field.               */
  #define CLOCK_INTENCLR_XOSTARTED_Min (0x0UL)       /*!< Min enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTENCLR_XOSTARTED_Max (0x1UL)       /*!< Max enumerator value of XOSTARTED field.                             */
  #define CLOCK_INTENCLR_XOSTARTED_Clear (0x1UL)     /*!< Disable                                                              */
  #define CLOCK_INTENCLR_XOSTARTED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define CLOCK_INTENCLR_XOSTARTED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* PLLSTARTED @Bit 1 : Write '1' to disable interrupt for event PLLSTARTED */
  #define CLOCK_INTENCLR_PLLSTARTED_Pos (1UL)        /*!< Position of PLLSTARTED field.                                        */
  #define CLOCK_INTENCLR_PLLSTARTED_Msk (0x1UL << CLOCK_INTENCLR_PLLSTARTED_Pos) /*!< Bit mask of PLLSTARTED field.            */
  #define CLOCK_INTENCLR_PLLSTARTED_Min (0x0UL)      /*!< Min enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTENCLR_PLLSTARTED_Max (0x1UL)      /*!< Max enumerator value of PLLSTARTED field.                            */
  #define CLOCK_INTENCLR_PLLSTARTED_Clear (0x1UL)    /*!< Disable                                                              */
  #define CLOCK_INTENCLR_PLLSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define CLOCK_INTENCLR_PLLSTARTED_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* LFCLKSTARTED @Bit 2 : Write '1' to disable interrupt for event LFCLKSTARTED */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Pos (2UL)      /*!< Position of LFCLKSTARTED field.                                      */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Msk (0x1UL << CLOCK_INTENCLR_LFCLKSTARTED_Pos) /*!< Bit mask of LFCLKSTARTED field.      */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Min (0x0UL)    /*!< Min enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Max (0x1UL)    /*!< Max enumerator value of LFCLKSTARTED field.                          */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Clear (0x1UL)  /*!< Disable                                                              */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CLOCK_INTENCLR_LFCLKSTARTED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* DONE @Bit 3 : Write '1' to disable interrupt for event DONE */
  #define CLOCK_INTENCLR_DONE_Pos (3UL)              /*!< Position of DONE field.                                              */
  #define CLOCK_INTENCLR_DONE_Msk (0x1UL << CLOCK_INTENCLR_DONE_Pos) /*!< Bit mask of DONE field.                              */
  #define CLOCK_INTENCLR_DONE_Min (0x0UL)            /*!< Min enumerator value of DONE field.                                  */
  #define CLOCK_INTENCLR_DONE_Max (0x1UL)            /*!< Max enumerator value of DONE field.                                  */
  #define CLOCK_INTENCLR_DONE_Clear (0x1UL)          /*!< Disable                                                              */
  #define CLOCK_INTENCLR_DONE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define CLOCK_INTENCLR_DONE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* XOTUNED @Bit 4 : Write '1' to disable interrupt for event XOTUNED */
  #define CLOCK_INTENCLR_XOTUNED_Pos (4UL)           /*!< Position of XOTUNED field.                                           */
  #define CLOCK_INTENCLR_XOTUNED_Msk (0x1UL << CLOCK_INTENCLR_XOTUNED_Pos) /*!< Bit mask of XOTUNED field.                     */
  #define CLOCK_INTENCLR_XOTUNED_Min (0x0UL)         /*!< Min enumerator value of XOTUNED field.                               */
  #define CLOCK_INTENCLR_XOTUNED_Max (0x1UL)         /*!< Max enumerator value of XOTUNED field.                               */
  #define CLOCK_INTENCLR_XOTUNED_Clear (0x1UL)       /*!< Disable                                                              */
  #define CLOCK_INTENCLR_XOTUNED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define CLOCK_INTENCLR_XOTUNED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

