NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* EVENTS_FPUOFC @Bit 0 : A floating-point overflow exception has occurred in the FPU. */
  #define CPUC_EVENTS_FPUOFC_EVENTS_FPUOFC_Pos (0UL) /*!< Position of EVENTS_FPUOFC field.                                     */
  #define CPUC_EVENTS_FPUOFC_EVENTS_FPUOFC_Msk (0x1UL << CPUC_EVENTS_FPUOFC_EVENTS_FPUOFC_Pos) /*!< Bit mask of EVENTS_FPUOFC
                                                                            field.*/
  #define CPUC_EVENTS_FPUOFC_EVENTS_FPUOFC_Min (0x0UL) /*!< Min enumerator value of EVENTS_FPUOFC field.                       */
  #define CPUC_EVENTS_FPUOFC_EVENTS_FPUOFC_Max (0x1UL) /*!< Max enumerator value of EVENTS_FPUOFC field.                       */
  #define CPUC_EVENTS_FPUOFC_EVENTS_FPUOFC_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define CPUC_EVENTS_FPUOFC_EVENTS_FPUOFC_Generated (0x1UL) /*!< Event generated                                              */


/* CPUC_EVENTS_FPUUFC: A floating-point underflow exception has occurred in the FPU. */
  #define CPUC_EVENTS_FPUUFC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FPUUFC register.                             */

/* EVENTS_FPUUFC @Bit 0 : A floating-point underflow exception has occurred in the FPU. */
  #define CPUC_EVENTS_FPUUFC_EVENTS_FPUUFC_Pos (0UL) /*!< Position of EVENTS_FPUUFC field.                                     */
  #define CPUC_EVENTS_FPUUFC_EVENTS_FPUUFC_Msk (0x1UL << CPUC_EVENTS_FPUUFC_EVENTS_FPUUFC_Pos) /*!< Bit mask of EVENTS_FPUUFC
                                                                            field.*/
  #define CPUC_EVENTS_FPUUFC_EVENTS_FPUUFC_Min (0x0UL) /*!< Min enumerator value of EVENTS_FPUUFC field.                       */
  #define CPUC_EVENTS_FPUUFC_EVENTS_FPUUFC_Max (0x1UL) /*!< Max enumerator value of EVENTS_FPUUFC field.                       */
  #define CPUC_EVENTS_FPUUFC_EVENTS_FPUUFC_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define CPUC_EVENTS_FPUUFC_EVENTS_FPUUFC_Generated (0x1UL) /*!< Event generated                                              */


/* CPUC_EVENTS_FPUIXC: A floating-point inexact exception has occurred in the FPU. */
  #define CPUC_EVENTS_FPUIXC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FPUIXC register.                             */

/* EVENTS_FPUIXC @Bit 0 : A floating-point inexact exception has occurred in the FPU. */
  #define CPUC_EVENTS_FPUIXC_EVENTS_FPUIXC_Pos (0UL) /*!< Position of EVENTS_FPUIXC field.                                     */
  #define CPUC_EVENTS_FPUIXC_EVENTS_FPUIXC_Msk (0x1UL << CPUC_EVENTS_FPUIXC_EVENTS_FPUIXC_Pos) /*!< Bit mask of EVENTS_FPUIXC
                                                                            field.*/
  #define CPUC_EVENTS_FPUIXC_EVENTS_FPUIXC_Min (0x0UL) /*!< Min enumerator value of EVENTS_FPUIXC field.                       */
  #define CPUC_EVENTS_FPUIXC_EVENTS_FPUIXC_Max (0x1UL) /*!< Max enumerator value of EVENTS_FPUIXC field.                       */
  #define CPUC_EVENTS_FPUIXC_EVENTS_FPUIXC_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define CPUC_EVENTS_FPUIXC_EVENTS_FPUIXC_Generated (0x1UL) /*!< Event generated                                              */


/* CPUC_EVENTS_FPUIDC: A floating-point input denormal exception has occurred in the FPU. */
  #define CPUC_EVENTS_FPUIDC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FPUIDC register.                             */

/* EVENTS_FPUIDC @Bit 0 : A floating-point input denormal exception has occurred in the FPU. */
  #define CPUC_EVENTS_FPUIDC_EVENTS_FPUIDC_Pos (0UL) /*!< Position of EVENTS_FPUIDC field.                                     */
  #define CPUC_EVENTS_FPUIDC_EVENTS_FPUIDC_Msk (0x1UL << CPUC_EVENTS_FPUIDC_EVENTS_FPUIDC_Pos) /*!< Bit mask of EVENTS_FPUIDC
                                                                            field.*/
  #define CPUC_EVENTS_FPUIDC_EVENTS_FPUIDC_Min (0x0UL) /*!< Min enumerator value of EVENTS_FPUIDC field.                       */
  #define CPUC_EVENTS_FPUIDC_EVENTS_FPUIDC_Max (0x1UL) /*!< Max enumerator value of EVENTS_FPUIDC field.                       */
  #define CPUC_EVENTS_FPUIDC_EVENTS_FPUIDC_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define CPUC_EVENTS_FPUIDC_EVENTS_FPUIDC_Generated (0x1UL) /*!< Event generated                                              */


/* CPUC_INTEN: Enable or disable interrupt */
  #define CPUC_INTEN_ResetValue (0x00000000UL)       /*!< Reset value of INTEN register.                                       */

/* FPUIOC @Bit 0 : Enable or disable interrupt for event FPUIOC */
  #define CPUC_INTEN_FPUIOC_Pos (0UL)                /*!< Position of FPUIOC field.                                            */
  #define CPUC_INTEN_FPUIOC_Msk (0x1UL << CPUC_INTEN_FPUIOC_Pos) /*!< Bit mask of FPUIOC field.                                */
  #define CPUC_INTEN_FPUIOC_Min (0x0UL)              /*!< Min enumerator value of FPUIOC field.                                */
  #define CPUC_INTEN_FPUIOC_Max (0x1UL)              /*!< Max enumerator value of FPUIOC field.                                */
  #define CPUC_INTEN_FPUIOC_Disabled (0x0UL)         /*!< Disable                                                              */
  #define CPUC_INTEN_FPUIOC_Enabled (0x1UL)          /*!< Enable                                                               */

/* FPUDZC @Bit 1 : Enable or disable interrupt for event FPUDZC */
  #define CPUC_INTEN_FPUDZC_Pos (1UL)                /*!< Position of FPUDZC field.                                            */
  #define CPUC_INTEN_FPUDZC_Msk (0x1UL << CPUC_INTEN_FPUDZC_Pos) /*!< Bit mask of FPUDZC field.                                */
  #define CPUC_INTEN_FPUDZC_Min (0x0UL)              /*!< Min enumerator value of FPUDZC field.                                */
  #define CPUC_INTEN_FPUDZC_Max (0x1UL)              /*!< Max enumerator value of FPUDZC field.                                */
  #define CPUC_INTEN_FPUDZC_Disabled (0x0UL)         /*!< Disable                                                              */
  #define CPUC_INTEN_FPUDZC_Enabled (0x1UL)          /*!< Enable                                                               */

