NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* =============================================== Struct DPPIC_SUBSCRIBE_CHG ================================================ */
/**
  * @brief SUBSCRIBE_CHG [DPPIC_SUBSCRIBE_CHG] Subscribe configuration for tasks
  */
typedef struct {
  __IOM uint32_t  EN;                                /*!< (@ 0x00000000) Subscribe configuration for task CHG[n].EN            */
  __IOM uint32_t  DIS;                               /*!< (@ 0x00000004) Subscribe configuration for task CHG[n].DIS           */
} NRF_DPPIC_SUBSCRIBE_CHG_Type;                      /*!< Size = 8 (0x008)                                                     */
  #define DPPIC_SUBSCRIBE_CHG_MaxCount (6UL)         /*!< Size of SUBSCRIBE_CHG[6] array.                                      */
  #define DPPIC_SUBSCRIBE_CHG_MaxIndex (5UL)         /*!< Max index of SUBSCRIBE_CHG[6] array.                                 */
  #define DPPIC_SUBSCRIBE_CHG_MinIndex (0UL)         /*!< Min index of SUBSCRIBE_CHG[6] array.                                 */

/* DPPIC_SUBSCRIBE_CHG_EN: Subscribe configuration for task CHG[n].EN */
  #define DPPIC_SUBSCRIBE_CHG_EN_ResetValue (0x00000000UL) /*!< Reset value of EN register.                                    */

/* CHIDX @Bits 0..7 : DPPI channel that task CHG[n].EN will subscribe to */
  #define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Msk (0xFFUL << DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define DPPIC_SUBSCRIBE_CHG_EN_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define DPPIC_SUBSCRIBE_CHG_EN_EN_Msk (0x1UL << DPPIC_SUBSCRIBE_CHG_EN_EN_Pos) /*!< Bit mask of EN field.                    */
  #define DPPIC_SUBSCRIBE_CHG_EN_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define DPPIC_SUBSCRIBE_CHG_EN_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define DPPIC_SUBSCRIBE_CHG_EN_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define DPPIC_SUBSCRIBE_CHG_EN_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* DPPIC_SUBSCRIBE_CHG_DIS: Subscribe configuration for task CHG[n].DIS */
  #define DPPIC_SUBSCRIBE_CHG_DIS_ResetValue (0x00000000UL) /*!< Reset value of DIS register.                                  */

/* CHIDX @Bits 0..7 : DPPI channel that task CHG[n].DIS will subscribe to */
  #define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Msk (0xFFUL << DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define DPPIC_SUBSCRIBE_CHG_DIS_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define DPPIC_SUBSCRIBE_CHG_DIS_EN_Msk (0x1UL << DPPIC_SUBSCRIBE_CHG_DIS_EN_Pos) /*!< Bit mask of EN field.                  */
  #define DPPIC_SUBSCRIBE_CHG_DIS_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define DPPIC_SUBSCRIBE_CHG_DIS_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define DPPIC_SUBSCRIBE_CHG_DIS_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define DPPIC_SUBSCRIBE_CHG_DIS_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* ====================================================== Struct DPPIC ======================================================= */
/**
  * @brief Distributed programmable peripheral interconnect controller
  */
  typedef struct {                                   /*!< DPPIC Structure                                                      */
    __OM NRF_DPPIC_TASKS_CHG_Type TASKS_CHG[6];      /*!< (@ 0x00000000) Channel group tasks                                   */
    __IM uint32_t RESERVED[20];
    __IOM NRF_DPPIC_SUBSCRIBE_CHG_Type SUBSCRIBE_CHG[6]; /*!< (@ 0x00000080) Subscribe configuration for tasks                 */
    __IM uint32_t RESERVED1[276];
    __IOM uint32_t CHEN;                             /*!< (@ 0x00000500) Channel enable register                               */
    __IOM uint32_t CHENSET;                          /*!< (@ 0x00000504) Channel enable set register                           */
    __IOM uint32_t CHENCLR;                          /*!< (@ 0x00000508) Channel enable clear register                         */
    __IM uint32_t RESERVED2[189];
    __IOM uint32_t CHG[6];                           /*!< (@ 0x00000800) Channel group n Note: Writes to this register are
                                                                         ignored if either SUBSCRIBE_CHG[n].EN or
                                                                         SUBSCRIBE_CHG[n].DIS is enabled*/
  } NRF_DPPIC_Type;                                  /*!< Size = 2072 (0x818)                                                  */

/* DPPIC_CHEN: Channel enable register */
  #define DPPIC_CHEN_ResetValue (0x00000000UL)       /*!< Reset value of CHEN register.                                        */

/* CH0 @Bit 0 : Enable or disable channel 0 */
  #define DPPIC_CHEN_CH0_Pos (0UL)                   /*!< Position of CH0 field.                                               */
  #define DPPIC_CHEN_CH0_Msk (0x1UL << DPPIC_CHEN_CH0_Pos) /*!< Bit mask of CH0 field.                                         */
  #define DPPIC_CHEN_CH0_Min (0x0UL)                 /*!< Min enumerator value of CH0 field.                                   */
  #define DPPIC_CHEN_CH0_Max (0x1UL)                 /*!< Max enumerator value of CH0 field.                                   */
  #define DPPIC_CHEN_CH0_Disabled (0x0UL)            /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH0_Enabled (0x1UL)             /*!< Enable channel                                                       */

