NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* PC2 @Bit 2 : Selects processor comparator 2 inputs for Single-shot control */
  #define ETM_TRCSSPCICR0_PC2_Pos (2UL)              /*!< Position of PC2 field.                                               */
  #define ETM_TRCSSPCICR0_PC2_Msk (0x1UL << ETM_TRCSSPCICR0_PC2_Pos) /*!< Bit mask of PC2 field.                               */
  #define ETM_TRCSSPCICR0_PC2_Min (0x0UL)            /*!< Min enumerator value of PC2 field.                                   */
  #define ETM_TRCSSPCICR0_PC2_Max (0x1UL)            /*!< Max enumerator value of PC2 field.                                   */
  #define ETM_TRCSSPCICR0_PC2_Disabled (0x0UL)       /*!< Processor comparator 2 is not selected for Single-shot control.      */
  #define ETM_TRCSSPCICR0_PC2_Enabled (0x1UL)        /*!< Processor comparator 2 is selected for Single-shot control.          */

/* PC3 @Bit 3 : Selects processor comparator 3 inputs for Single-shot control */
  #define ETM_TRCSSPCICR0_PC3_Pos (3UL)              /*!< Position of PC3 field.                                               */
  #define ETM_TRCSSPCICR0_PC3_Msk (0x1UL << ETM_TRCSSPCICR0_PC3_Pos) /*!< Bit mask of PC3 field.                               */
  #define ETM_TRCSSPCICR0_PC3_Min (0x0UL)            /*!< Min enumerator value of PC3 field.                                   */
  #define ETM_TRCSSPCICR0_PC3_Max (0x1UL)            /*!< Max enumerator value of PC3 field.                                   */
  #define ETM_TRCSSPCICR0_PC3_Disabled (0x0UL)       /*!< Processor comparator 3 is not selected for Single-shot control.      */
  #define ETM_TRCSSPCICR0_PC3_Enabled (0x1UL)        /*!< Processor comparator 3 is selected for Single-shot control.          */


/* ETM_TRCPDCR: Controls the single-shot comparator. */
  #define ETM_TRCPDCR_ResetValue (0x00000000UL)      /*!< Reset value of TRCPDCR register.                                     */

/* PU @Bit 24 : Power up request, to request that power to ETM and access to the trace registers is maintained. */
  #define ETM_TRCPDCR_PU_Pos (24UL)                  /*!< Position of PU field.                                                */
  #define ETM_TRCPDCR_PU_Msk (0x1UL << ETM_TRCPDCR_PU_Pos) /*!< Bit mask of PU field.                                          */
  #define ETM_TRCPDCR_PU_Min (0x0UL)                 /*!< Min enumerator value of PU field.                                    */
  #define ETM_TRCPDCR_PU_Max (0x1UL)                 /*!< Max enumerator value of PU field.                                    */
  #define ETM_TRCPDCR_PU_Disabled (0x0UL)            /*!< Power not requested.                                                 */
  #define ETM_TRCPDCR_PU_Enabled (0x1UL)             /*!< Power requested.                                                     */


/* ETM_TRCPDSR: Indicates the power down status of the ETM. */
  #define ETM_TRCPDSR_ResetValue (0x00000000UL)      /*!< Reset value of TRCPDSR register.                                     */

/* POWER @Bit 0 : Indicates ETM is powered up */
  #define ETM_TRCPDSR_POWER_Pos (0UL)                /*!< Position of POWER field.                                             */
  #define ETM_TRCPDSR_POWER_Msk (0x1UL << ETM_TRCPDSR_POWER_Pos) /*!< Bit mask of POWER field.                                 */
  #define ETM_TRCPDSR_POWER_Min (0x0UL)              /*!< Min enumerator value of POWER field.                                 */
  #define ETM_TRCPDSR_POWER_Max (0x1UL)              /*!< Max enumerator value of POWER field.                                 */
  #define ETM_TRCPDSR_POWER_NotPoweredUp (0x0UL)     /*!< ETM is not powered up. All registers are not accessible.             */
  #define ETM_TRCPDSR_POWER_PoweredUp (0x1UL)        /*!< ETM is powered up. All registers are accessible.                     */

/* STICKYPD @Bit 1 : Sticky power down state. This bit is set to 1 when power to the ETM registers is removed, to indicate that
                     programming state has been lost. It is cleared after a read of the TRCPDSR */

  #define ETM_TRCPDSR_STICKYPD_Pos (1UL)             /*!< Position of STICKYPD field.                                          */
  #define ETM_TRCPDSR_STICKYPD_Msk (0x1UL << ETM_TRCPDSR_STICKYPD_Pos) /*!< Bit mask of STICKYPD field.                        */
  #define ETM_TRCPDSR_STICKYPD_Min (0x0UL)           /*!< Min enumerator value of STICKYPD field.                              */
  #define ETM_TRCPDSR_STICKYPD_Max (0x1UL)           /*!< Max enumerator value of STICKYPD field.                              */
  #define ETM_TRCPDSR_STICKYPD_NotPoweredDown (0x0UL) /*!< Trace register power has not been removed since the TRCPDSR was last
                                                           read.*/
  #define ETM_TRCPDSR_STICKYPD_PoweredDown (0x1UL)   /*!< Trace register power has been removed since the TRCPDSR was last
                                                          read.*/


/* ETM_TRCITATBIDR: Sets the state of output pins. */
  #define ETM_TRCITATBIDR_ResetValue (0x00000000UL)  /*!< Reset value of TRCITATBIDR register.                                 */

/* ID0 @Bit 0 : Drives the ATIDMI[0] output pin. */
  #define ETM_TRCITATBIDR_ID0_Pos (0UL)              /*!< Position of ID0 field.                                               */
  #define ETM_TRCITATBIDR_ID0_Msk (0x1UL << ETM_TRCITATBIDR_ID0_Pos) /*!< Bit mask of ID0 field.                               */

/* ID1 @Bit 1 : Drives the ATIDMI[1] output pin. */
  #define ETM_TRCITATBIDR_ID1_Pos (1UL)              /*!< Position of ID1 field.                                               */
  #define ETM_TRCITATBIDR_ID1_Msk (0x1UL << ETM_TRCITATBIDR_ID1_Pos) /*!< Bit mask of ID1 field.                               */

/* ID2 @Bit 2 : Drives the ATIDMI[2] output pin. */
  #define ETM_TRCITATBIDR_ID2_Pos (2UL)              /*!< Position of ID2 field.                                               */
  #define ETM_TRCITATBIDR_ID2_Msk (0x1UL << ETM_TRCITATBIDR_ID2_Pos) /*!< Bit mask of ID2 field.                               */

/* ID3 @Bit 3 : Drives the ATIDMI[3] output pin. */
  #define ETM_TRCITATBIDR_ID3_Pos (3UL)              /*!< Position of ID3 field.                                               */
  #define ETM_TRCITATBIDR_ID3_Msk (0x1UL << ETM_TRCITATBIDR_ID3_Pos) /*!< Bit mask of ID3 field.                               */

/* ID4 @Bit 4 : Drives the ATIDMI[4] output pin. */
  #define ETM_TRCITATBIDR_ID4_Pos (4UL)              /*!< Position of ID4 field.                                               */
  #define ETM_TRCITATBIDR_ID4_Msk (0x1UL << ETM_TRCITATBIDR_ID4_Pos) /*!< Bit mask of ID4 field.                               */

/* ID5 @Bit 5 : Drives the ATIDMI[5] output pin. */
  #define ETM_TRCITATBIDR_ID5_Pos (5UL)              /*!< Position of ID5 field.                                               */
  #define ETM_TRCITATBIDR_ID5_Msk (0x1UL << ETM_TRCITATBIDR_ID5_Pos) /*!< Bit mask of ID5 field.                               */

