NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* ETM_TRCDEVARCH: The TRCDEVARCH identifies ETM-M33 as an ETMv4.2 component */
  #define ETM_TRCDEVARCH_ResetValue (0x00000000UL)   /*!< Reset value of TRCDEVARCH register.                                  */

/* ARCHID @Bits 0..15 : Architecture ID */
  #define ETM_TRCDEVARCH_ARCHID_Pos (0UL)            /*!< Position of ARCHID field.                                            */
  #define ETM_TRCDEVARCH_ARCHID_Msk (0xFFFFUL << ETM_TRCDEVARCH_ARCHID_Pos) /*!< Bit mask of ARCHID field.                     */
  #define ETM_TRCDEVARCH_ARCHID_Min (0x4A13UL)       /*!< Min enumerator value of ARCHID field.                                */
  #define ETM_TRCDEVARCH_ARCHID_Max (0x4A13UL)       /*!< Max enumerator value of ARCHID field.                                */
  #define ETM_TRCDEVARCH_ARCHID_ETMv42 (0x4A13UL)    /*!< Component is an ETMv4 component                                      */

/* REVISION @Bits 16..19 : Architecture revision */
  #define ETM_TRCDEVARCH_REVISION_Pos (16UL)         /*!< Position of REVISION field.                                          */
  #define ETM_TRCDEVARCH_REVISION_Msk (0xFUL << ETM_TRCDEVARCH_REVISION_Pos) /*!< Bit mask of REVISION field.                  */
  #define ETM_TRCDEVARCH_REVISION_Min (0x2UL)        /*!< Min enumerator value of REVISION field.                              */
  #define ETM_TRCDEVARCH_REVISION_Max (0x2UL)        /*!< Max enumerator value of REVISION field.                              */
  #define ETM_TRCDEVARCH_REVISION_v2 (0x2UL)         /*!< Component is part of architecture 4.2                                */

/* PRESENT @Bit 20 : This register is implemented */
  #define ETM_TRCDEVARCH_PRESENT_Pos (20UL)          /*!< Position of PRESENT field.                                           */
  #define ETM_TRCDEVARCH_PRESENT_Msk (0x1UL << ETM_TRCDEVARCH_PRESENT_Pos) /*!< Bit mask of PRESENT field.                     */
  #define ETM_TRCDEVARCH_PRESENT_Min (0x0UL)         /*!< Min enumerator value of PRESENT field.                               */
  #define ETM_TRCDEVARCH_PRESENT_Max (0x1UL)         /*!< Max enumerator value of PRESENT field.                               */
  #define ETM_TRCDEVARCH_PRESENT_Absent (0x0UL)      /*!< The register is not implemented.                                     */
  #define ETM_TRCDEVARCH_PRESENT_Present (0x1UL)     /*!< The register is implemented.                                         */

/* ARCHITECT @Bits 21..31 : Defines the architect of the component */
  #define ETM_TRCDEVARCH_ARCHITECT_Pos (21UL)        /*!< Position of ARCHITECT field.                                         */
  #define ETM_TRCDEVARCH_ARCHITECT_Msk (0x7FFUL << ETM_TRCDEVARCH_ARCHITECT_Pos) /*!< Bit mask of ARCHITECT field.             */
  #define ETM_TRCDEVARCH_ARCHITECT_Min (0x23BUL)     /*!< Min enumerator value of ARCHITECT field.                             */
  #define ETM_TRCDEVARCH_ARCHITECT_Max (0x23BUL)     /*!< Max enumerator value of ARCHITECT field.                             */
  #define ETM_TRCDEVARCH_ARCHITECT_Arm (0x23BUL)     /*!< This peripheral was architected by Arm.                              */


/* ETM_TRCDEVTYPE: Controls the single-shot comparator. */
  #define ETM_TRCDEVTYPE_ResetValue (0x00000000UL)   /*!< Reset value of TRCDEVTYPE register.                                  */

/* MAJOR @Bits 0..3 : The main type of the component */
  #define ETM_TRCDEVTYPE_MAJOR_Pos (0UL)             /*!< Position of MAJOR field.                                             */
  #define ETM_TRCDEVTYPE_MAJOR_Msk (0xFUL << ETM_TRCDEVTYPE_MAJOR_Pos) /*!< Bit mask of MAJOR field.                           */
  #define ETM_TRCDEVTYPE_MAJOR_Min (0x3UL)           /*!< Min enumerator value of MAJOR field.                                 */
  #define ETM_TRCDEVTYPE_MAJOR_Max (0x3UL)           /*!< Max enumerator value of MAJOR field.                                 */
  #define ETM_TRCDEVTYPE_MAJOR_TraceSource (0x3UL)   /*!< Peripheral is a trace source.                                        */

/* SUB @Bits 4..7 : The sub-type of the component */
  #define ETM_TRCDEVTYPE_SUB_Pos (4UL)               /*!< Position of SUB field.                                               */
  #define ETM_TRCDEVTYPE_SUB_Msk (0xFUL << ETM_TRCDEVTYPE_SUB_Pos) /*!< Bit mask of SUB field.                                 */
  #define ETM_TRCDEVTYPE_SUB_Min (0x1UL)             /*!< Min enumerator value of SUB field.                                   */
  #define ETM_TRCDEVTYPE_SUB_Max (0x1UL)             /*!< Max enumerator value of SUB field.                                   */
  #define ETM_TRCDEVTYPE_SUB_ProcessorTrace (0x1UL)  /*!< Peripheral is a processor trace source.                              */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           FICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct FICR_INFO ===================================================== */
/**
  * @brief INFO [FICR_INFO] Device info
  */
typedef struct {
  __IM  uint32_t  CONFIGID;                          /*!< (@ 0x00000000) Configuration identifier                              */
  __IM  uint32_t  DEVICEID[2];                       /*!< (@ 0x00000004) Device identifier                                     */
  __IM  uint32_t  UUID[4];                           /*!< (@ 0x0000000C) 128-bit Universally Unique IDentifier (UUID).         */
  __IM  uint32_t  PART;                              /*!< (@ 0x0000001C) Part code                                             */
  __IM  uint32_t  VARIANT;                           /*!< (@ 0x00000020) Part Variant, Hardware version and Production
                                                                         configuration*/
  __IM  uint32_t  PACKAGE;                           /*!< (@ 0x00000024) Package option                                        */
  __IM  uint32_t  RAM;                               /*!< (@ 0x00000028) RAM size (KB)                                         */
  __IM  uint32_t  RRAM;                              /*!< (@ 0x0000002C) RRAM size (KB)                                        */
} NRF_FICR_INFO_Type;                                /*!< Size = 48 (0x030)                                                    */

/* FICR_INFO_CONFIGID: Configuration identifier */
  #define FICR_INFO_CONFIGID_ResetValue (0xFFFFFFFFUL) /*!< Reset value of CONFIGID register.                                  */

/* HWID @Bits 0..15 : Identification number for the HW */
  #define FICR_INFO_CONFIGID_HWID_Pos (0UL)          /*!< Position of HWID field.                                              */
  #define FICR_INFO_CONFIGID_HWID_Msk (0xFFFFUL << FICR_INFO_CONFIGID_HWID_Pos) /*!< Bit mask of HWID field.                   */


/* FICR_INFO_DEVICEID: Device identifier */
  #define FICR_INFO_DEVICEID_MaxCount (2UL)          /*!< Max size of DEVICEID[2] array.                                       */
  #define FICR_INFO_DEVICEID_MaxIndex (1UL)          /*!< Max index of DEVICEID[2] array.                                      */
  #define FICR_INFO_DEVICEID_MinIndex (0UL)          /*!< Min index of DEVICEID[2] array.                                      */
  #define FICR_INFO_DEVICEID_ResetValue (0xFFFFFFFFUL) /*!< Reset value of DEVICEID[2] register.                               */

/* DEVICEID @Bits 0..31 : 64 bit unique device identifier */
  #define FICR_INFO_DEVICEID_DEVICEID_Pos (0UL)      /*!< Position of DEVICEID field.                                          */
  #define FICR_INFO_DEVICEID_DEVICEID_Msk (0xFFFFFFFFUL << FICR_INFO_DEVICEID_DEVICEID_Pos) /*!< Bit mask of DEVICEID field.   */


