NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* PIN15 @Bit 15 : Pin 15 */
  #define GPIO_OUTSET_PIN15_Pos (15UL)               /*!< Position of PIN15 field.                                             */
  #define GPIO_OUTSET_PIN15_Msk (0x1UL << GPIO_OUTSET_PIN15_Pos) /*!< Bit mask of PIN15 field.                                 */
  #define GPIO_OUTSET_PIN15_Min (0x0UL)              /*!< Min enumerator value of PIN15 field.                                 */
  #define GPIO_OUTSET_PIN15_Max (0x1UL)              /*!< Max enumerator value of PIN15 field.                                 */
  #define GPIO_OUTSET_PIN15_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN15_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN15_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN16 @Bit 16 : Pin 16 */
  #define GPIO_OUTSET_PIN16_Pos (16UL)               /*!< Position of PIN16 field.                                             */
  #define GPIO_OUTSET_PIN16_Msk (0x1UL << GPIO_OUTSET_PIN16_Pos) /*!< Bit mask of PIN16 field.                                 */
  #define GPIO_OUTSET_PIN16_Min (0x0UL)              /*!< Min enumerator value of PIN16 field.                                 */
  #define GPIO_OUTSET_PIN16_Max (0x1UL)              /*!< Max enumerator value of PIN16 field.                                 */
  #define GPIO_OUTSET_PIN16_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN16_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN16_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN17 @Bit 17 : Pin 17 */
  #define GPIO_OUTSET_PIN17_Pos (17UL)               /*!< Position of PIN17 field.                                             */
  #define GPIO_OUTSET_PIN17_Msk (0x1UL << GPIO_OUTSET_PIN17_Pos) /*!< Bit mask of PIN17 field.                                 */
  #define GPIO_OUTSET_PIN17_Min (0x0UL)              /*!< Min enumerator value of PIN17 field.                                 */
  #define GPIO_OUTSET_PIN17_Max (0x1UL)              /*!< Max enumerator value of PIN17 field.                                 */
  #define GPIO_OUTSET_PIN17_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN17_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN17_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN18 @Bit 18 : Pin 18 */
  #define GPIO_OUTSET_PIN18_Pos (18UL)               /*!< Position of PIN18 field.                                             */
  #define GPIO_OUTSET_PIN18_Msk (0x1UL << GPIO_OUTSET_PIN18_Pos) /*!< Bit mask of PIN18 field.                                 */
  #define GPIO_OUTSET_PIN18_Min (0x0UL)              /*!< Min enumerator value of PIN18 field.                                 */
  #define GPIO_OUTSET_PIN18_Max (0x1UL)              /*!< Max enumerator value of PIN18 field.                                 */
  #define GPIO_OUTSET_PIN18_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN18_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN18_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN19 @Bit 19 : Pin 19 */
  #define GPIO_OUTSET_PIN19_Pos (19UL)               /*!< Position of PIN19 field.                                             */
  #define GPIO_OUTSET_PIN19_Msk (0x1UL << GPIO_OUTSET_PIN19_Pos) /*!< Bit mask of PIN19 field.                                 */
  #define GPIO_OUTSET_PIN19_Min (0x0UL)              /*!< Min enumerator value of PIN19 field.                                 */
  #define GPIO_OUTSET_PIN19_Max (0x1UL)              /*!< Max enumerator value of PIN19 field.                                 */
  #define GPIO_OUTSET_PIN19_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN19_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN19_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN20 @Bit 20 : Pin 20 */
  #define GPIO_OUTSET_PIN20_Pos (20UL)               /*!< Position of PIN20 field.                                             */
  #define GPIO_OUTSET_PIN20_Msk (0x1UL << GPIO_OUTSET_PIN20_Pos) /*!< Bit mask of PIN20 field.                                 */
  #define GPIO_OUTSET_PIN20_Min (0x0UL)              /*!< Min enumerator value of PIN20 field.                                 */
  #define GPIO_OUTSET_PIN20_Max (0x1UL)              /*!< Max enumerator value of PIN20 field.                                 */
  #define GPIO_OUTSET_PIN20_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN20_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN20_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN21 @Bit 21 : Pin 21 */
  #define GPIO_OUTSET_PIN21_Pos (21UL)               /*!< Position of PIN21 field.                                             */
  #define GPIO_OUTSET_PIN21_Msk (0x1UL << GPIO_OUTSET_PIN21_Pos) /*!< Bit mask of PIN21 field.                                 */
  #define GPIO_OUTSET_PIN21_Min (0x0UL)              /*!< Min enumerator value of PIN21 field.                                 */
  #define GPIO_OUTSET_PIN21_Max (0x1UL)              /*!< Max enumerator value of PIN21 field.                                 */
  #define GPIO_OUTSET_PIN21_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN21_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN21_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN22 @Bit 22 : Pin 22 */
  #define GPIO_OUTSET_PIN22_Pos (22UL)               /*!< Position of PIN22 field.                                             */
  #define GPIO_OUTSET_PIN22_Msk (0x1UL << GPIO_OUTSET_PIN22_Pos) /*!< Bit mask of PIN22 field.                                 */
  #define GPIO_OUTSET_PIN22_Min (0x0UL)              /*!< Min enumerator value of PIN22 field.                                 */
  #define GPIO_OUTSET_PIN22_Max (0x1UL)              /*!< Max enumerator value of PIN22 field.                                 */
  #define GPIO_OUTSET_PIN22_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN22_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN22_Set (0x1UL)              /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

