NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
  #define I2S_CHANNEL_MaxCount (2UL)                 /*!< Size of CHANNEL[2] array.                                            */
  #define I2S_CHANNEL_MaxIndex (1UL)                 /*!< Max index of CHANNEL[2] array.                                       */
  #define I2S_CHANNEL_MinIndex (0UL)                 /*!< Min index of CHANNEL[2] array.                                       */

/* I2S_CHANNEL_TERMINATEONBUSERROR: Terminate the transaction if a BUSERROR event is detected. */
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ResetValue (0x00000000UL) /*!< Reset value of TERMINATEONBUSERROR register.          */

/* ENABLE @Bit 0 : (unspecified) */
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                      */
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Msk (0x1UL << I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Pos) /*!< Bit mask of
                                                                            ENABLE field.*/
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                        */
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                        */
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Disabled (0x0UL) /*!< Disable                                                 */
  #define I2S_CHANNEL_TERMINATEONBUSERROR_ENABLE_Enabled (0x1UL) /*!< Enable                                                   */


/* I2S_CHANNEL_BUSERRORADDRESS: Address of transaction that generated the last BUSERROR event. */
  #define I2S_CHANNEL_BUSERRORADDRESS_ResetValue (0x00000000UL) /*!< Reset value of BUSERRORADDRESS register.                  */

/* ADDRESS @Bits 0..31 : (unspecified) */
  #define I2S_CHANNEL_BUSERRORADDRESS_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field.                                        */
  #define I2S_CHANNEL_BUSERRORADDRESS_ADDRESS_Msk (0xFFFFFFFFUL << I2S_CHANNEL_BUSERRORADDRESS_ADDRESS_Pos) /*!< Bit mask of
                                                                            ADDRESS field.*/


/* ======================================================= Struct I2S ======================================================== */
/**
  * @brief Inter-IC Sound
  */
  typedef struct {                                   /*!< I2S Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Starts continuous I2S transfer. Also starts MCK
                                                                         generator when this is enabled*/
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stops I2S transfer and MCK generator. Triggering this
                                                                         task will cause the event STOPPED to be generated.*/
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[31];
    __IOM uint32_t EVENTS_RXPTRUPD;                  /*!< (@ 0x00000104) The RXD.PTR register has been copied to internal
                                                                         double-buffers. When the I2S module is started and RX
                                                                         is enabled, this event will be generated for every
                                                                         ceil(RXTXD.MAXCNT/4) words received on the SDIN pin.*/
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000108) I2S transfer stopped.                                 */
    __IM uint32_t RESERVED2[2];
    __IOM uint32_t EVENTS_TXPTRUPD;                  /*!< (@ 0x00000114) The TDX.PTR register has been copied to internal
                                                                         double-buffers. When the I2S module is started and TX
                                                                         is enabled, this event will be generated for every
                                                                         ceil(RXTXD.MAXCNT/4) words that are sent on the SDOUT
                                                                         pin.*/
    __IM uint32_t RESERVED3;
    __IOM uint32_t EVENTS_FRAMESTART;                /*!< (@ 0x0000011C) Frame start event, generated on the active edge of
                                                                         LRCK*/
    __IM uint32_t RESERVED4[25];
    __IOM uint32_t PUBLISH_RXPTRUPD;                 /*!< (@ 0x00000184) Publish configuration for event RXPTRUPD              */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000188) Publish configuration for event STOPPED               */
    __IM uint32_t RESERVED5[2];
    __IOM uint32_t PUBLISH_TXPTRUPD;                 /*!< (@ 0x00000194) Publish configuration for event TXPTRUPD              */
    __IM uint32_t RESERVED6;
    __IOM uint32_t PUBLISH_FRAMESTART;               /*!< (@ 0x0000019C) Publish configuration for event FRAMESTART            */
    __IM uint32_t RESERVED7[88];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED8[125];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable I2S module                                     */
    __IOM NRF_I2S_CONFIG_Type CONFIG;                /*!< (@ 0x00000504) (unspecified)                                         */
    __IM uint32_t RESERVED9[3];
    __IOM NRF_I2S_RXD_Type RXD;                      /*!< (@ 0x00000538) (unspecified)                                         */
    __IM uint32_t RESERVED10;
    __IOM NRF_I2S_TXD_Type TXD;                      /*!< (@ 0x00000540) (unspecified)                                         */
    __IM uint32_t RESERVED11[3];
    __IOM NRF_I2S_RXTXD_Type RXTXD;                  /*!< (@ 0x00000550) (unspecified)                                         */
    __IM uint32_t RESERVED12[3];
    __IOM NRF_I2S_PSEL_Type PSEL;                    /*!< (@ 0x00000560) (unspecified)                                         */
    __IM uint32_t RESERVED13[3];
    __IOM NRF_I2S_CHANNEL_Type CHANNEL[2];           /*!< (@ 0x00000580) (unspecified)                                         */
  } NRF_I2S_Type;                                    /*!< Size = 1424 (0x590)                                                  */

/* I2S_TASKS_START: Starts continuous I2S transfer. Also starts MCK generator when this is enabled */
  #define I2S_TASKS_START_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_START register.                                 */

