NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* LPCOMP_EVENTS_UP: Upward crossing */
  #define LPCOMP_EVENTS_UP_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_UP register.                                   */

/* EVENTS_UP @Bit 0 : Upward crossing */
  #define LPCOMP_EVENTS_UP_EVENTS_UP_Pos (0UL)       /*!< Position of EVENTS_UP field.                                         */
  #define LPCOMP_EVENTS_UP_EVENTS_UP_Msk (0x1UL << LPCOMP_EVENTS_UP_EVENTS_UP_Pos) /*!< Bit mask of EVENTS_UP field.           */
  #define LPCOMP_EVENTS_UP_EVENTS_UP_Min (0x0UL)     /*!< Min enumerator value of EVENTS_UP field.                             */
  #define LPCOMP_EVENTS_UP_EVENTS_UP_Max (0x1UL)     /*!< Max enumerator value of EVENTS_UP field.                             */
  #define LPCOMP_EVENTS_UP_EVENTS_UP_NotGenerated (0x0UL) /*!< Event not generated                                             */
  #define LPCOMP_EVENTS_UP_EVENTS_UP_Generated (0x1UL) /*!< Event generated                                                    */


/* LPCOMP_EVENTS_CROSS: Downward or upward crossing */
  #define LPCOMP_EVENTS_CROSS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CROSS register.                             */

/* EVENTS_CROSS @Bit 0 : Downward or upward crossing */
  #define LPCOMP_EVENTS_CROSS_EVENTS_CROSS_Pos (0UL) /*!< Position of EVENTS_CROSS field.                                      */
  #define LPCOMP_EVENTS_CROSS_EVENTS_CROSS_Msk (0x1UL << LPCOMP_EVENTS_CROSS_EVENTS_CROSS_Pos) /*!< Bit mask of EVENTS_CROSS
                                                                            field.*/
  #define LPCOMP_EVENTS_CROSS_EVENTS_CROSS_Min (0x0UL) /*!< Min enumerator value of EVENTS_CROSS field.                        */
  #define LPCOMP_EVENTS_CROSS_EVENTS_CROSS_Max (0x1UL) /*!< Max enumerator value of EVENTS_CROSS field.                        */
  #define LPCOMP_EVENTS_CROSS_EVENTS_CROSS_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define LPCOMP_EVENTS_CROSS_EVENTS_CROSS_Generated (0x1UL) /*!< Event generated                                              */


/* LPCOMP_PUBLISH_READY: Publish configuration for event READY */
  #define LPCOMP_PUBLISH_READY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_READY register.                           */

/* CHIDX @Bits 0..7 : DPPI channel that event READY will publish to */
  #define LPCOMP_PUBLISH_READY_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define LPCOMP_PUBLISH_READY_CHIDX_Msk (0xFFUL << LPCOMP_PUBLISH_READY_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define LPCOMP_PUBLISH_READY_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define LPCOMP_PUBLISH_READY_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define LPCOMP_PUBLISH_READY_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define LPCOMP_PUBLISH_READY_EN_Msk (0x1UL << LPCOMP_PUBLISH_READY_EN_Pos) /*!< Bit mask of EN field.                        */
  #define LPCOMP_PUBLISH_READY_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define LPCOMP_PUBLISH_READY_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define LPCOMP_PUBLISH_READY_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define LPCOMP_PUBLISH_READY_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* LPCOMP_PUBLISH_DOWN: Publish configuration for event DOWN */
  #define LPCOMP_PUBLISH_DOWN_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_DOWN register.                             */

/* CHIDX @Bits 0..7 : DPPI channel that event DOWN will publish to */
  #define LPCOMP_PUBLISH_DOWN_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define LPCOMP_PUBLISH_DOWN_CHIDX_Msk (0xFFUL << LPCOMP_PUBLISH_DOWN_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define LPCOMP_PUBLISH_DOWN_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define LPCOMP_PUBLISH_DOWN_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define LPCOMP_PUBLISH_DOWN_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define LPCOMP_PUBLISH_DOWN_EN_Msk (0x1UL << LPCOMP_PUBLISH_DOWN_EN_Pos) /*!< Bit mask of EN field.                          */
  #define LPCOMP_PUBLISH_DOWN_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define LPCOMP_PUBLISH_DOWN_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define LPCOMP_PUBLISH_DOWN_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define LPCOMP_PUBLISH_DOWN_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* LPCOMP_PUBLISH_UP: Publish configuration for event UP */
  #define LPCOMP_PUBLISH_UP_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_UP register.                                 */

/* CHIDX @Bits 0..7 : DPPI channel that event UP will publish to */
  #define LPCOMP_PUBLISH_UP_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define LPCOMP_PUBLISH_UP_CHIDX_Msk (0xFFUL << LPCOMP_PUBLISH_UP_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define LPCOMP_PUBLISH_UP_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define LPCOMP_PUBLISH_UP_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define LPCOMP_PUBLISH_UP_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define LPCOMP_PUBLISH_UP_EN_Msk (0x1UL << LPCOMP_PUBLISH_UP_EN_Pos) /*!< Bit mask of EN field.                              */
  #define LPCOMP_PUBLISH_UP_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define LPCOMP_PUBLISH_UP_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define LPCOMP_PUBLISH_UP_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define LPCOMP_PUBLISH_UP_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* LPCOMP_PUBLISH_CROSS: Publish configuration for event CROSS */
  #define LPCOMP_PUBLISH_CROSS_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CROSS register.                           */

/* CHIDX @Bits 0..7 : DPPI channel that event CROSS will publish to */
  #define LPCOMP_PUBLISH_CROSS_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define LPCOMP_PUBLISH_CROSS_CHIDX_Msk (0xFFUL << LPCOMP_PUBLISH_CROSS_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define LPCOMP_PUBLISH_CROSS_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define LPCOMP_PUBLISH_CROSS_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define LPCOMP_PUBLISH_CROSS_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define LPCOMP_PUBLISH_CROSS_EN_Msk (0x1UL << LPCOMP_PUBLISH_CROSS_EN_Pos) /*!< Bit mask of EN field.                        */
  #define LPCOMP_PUBLISH_CROSS_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define LPCOMP_PUBLISH_CROSS_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define LPCOMP_PUBLISH_CROSS_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define LPCOMP_PUBLISH_CROSS_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* LPCOMP_SHORTS: Shortcuts between local events and tasks */
  #define LPCOMP_SHORTS_ResetValue (0x00000000UL)    /*!< Reset value of SHORTS register.                                      */

