NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* QDEC_PSEL_B: Pin select for B signal */
  #define QDEC_PSEL_B_ResetValue (0xFFFFFFFFUL)      /*!< Reset value of B register.                                           */

/* PIN @Bits 0..4 : Pin number */
  #define QDEC_PSEL_B_PIN_Pos (0UL)                  /*!< Position of PIN field.                                               */
  #define QDEC_PSEL_B_PIN_Msk (0x1FUL << QDEC_PSEL_B_PIN_Pos) /*!< Bit mask of PIN field.                                      */
  #define QDEC_PSEL_B_PIN_Min (0x00UL)               /*!< Min value of PIN field.                                              */
  #define QDEC_PSEL_B_PIN_Max (0x1FUL)               /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..7 : Port number */
  #define QDEC_PSEL_B_PORT_Pos (5UL)                 /*!< Position of PORT field.                                              */
  #define QDEC_PSEL_B_PORT_Msk (0x7UL << QDEC_PSEL_B_PORT_Pos) /*!< Bit mask of PORT field.                                    */
  #define QDEC_PSEL_B_PORT_Min (0x0UL)               /*!< Min value of PORT field.                                             */
  #define QDEC_PSEL_B_PORT_Max (0x7UL)               /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define QDEC_PSEL_B_CONNECT_Pos (31UL)             /*!< Position of CONNECT field.                                           */
  #define QDEC_PSEL_B_CONNECT_Msk (0x1UL << QDEC_PSEL_B_CONNECT_Pos) /*!< Bit mask of CONNECT field.                           */
  #define QDEC_PSEL_B_CONNECT_Min (0x0UL)            /*!< Min enumerator value of CONNECT field.                               */
  #define QDEC_PSEL_B_CONNECT_Max (0x1UL)            /*!< Max enumerator value of CONNECT field.                               */
  #define QDEC_PSEL_B_CONNECT_Disconnected (0x1UL)   /*!< Disconnect                                                           */
  #define QDEC_PSEL_B_CONNECT_Connected (0x0UL)      /*!< Connect                                                              */


/* ======================================================= Struct QDEC ======================================================= */
/**
  * @brief Quadrature Decoder
  */
  typedef struct {                                   /*!< QDEC Structure                                                       */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Task starting the quadrature decoder                  */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Task stopping the quadrature decoder                  */
    __OM uint32_t TASKS_READCLRACC;                  /*!< (@ 0x00000008) Read and clear ACC and ACCDBL                         */
    __OM uint32_t TASKS_RDCLRACC;                    /*!< (@ 0x0000000C) Read and clear ACC                                    */
    __OM uint32_t TASKS_RDCLRDBL;                    /*!< (@ 0x00000010) Read and clear ACCDBL                                 */
    __IM uint32_t RESERVED[27];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_READCLRACC;             /*!< (@ 0x00000088) Subscribe configuration for task READCLRACC           */
    __IOM uint32_t SUBSCRIBE_RDCLRACC;               /*!< (@ 0x0000008C) Subscribe configuration for task RDCLRACC             */
    __IOM uint32_t SUBSCRIBE_RDCLRDBL;               /*!< (@ 0x00000090) Subscribe configuration for task RDCLRDBL             */
    __IM uint32_t RESERVED1[27];
    __IOM uint32_t EVENTS_SAMPLERDY;                 /*!< (@ 0x00000100) Event being generated for every new sample value
                                                                         written to the SAMPLE register*/
    __IOM uint32_t EVENTS_REPORTRDY;                 /*!< (@ 0x00000104) Non-null report ready                                 */
    __IOM uint32_t EVENTS_ACCOF;                     /*!< (@ 0x00000108) ACC or ACCDBL register overflow                       */
    __IOM uint32_t EVENTS_DBLRDY;                    /*!< (@ 0x0000010C) Double displacement(s) detected                       */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000110) QDEC has been stopped                                 */
    __IM uint32_t RESERVED2[27];
    __IOM uint32_t PUBLISH_SAMPLERDY;                /*!< (@ 0x00000180) Publish configuration for event SAMPLERDY             */
    __IOM uint32_t PUBLISH_REPORTRDY;                /*!< (@ 0x00000184) Publish configuration for event REPORTRDY             */
    __IOM uint32_t PUBLISH_ACCOF;                    /*!< (@ 0x00000188) Publish configuration for event ACCOF                 */
    __IOM uint32_t PUBLISH_DBLRDY;                   /*!< (@ 0x0000018C) Publish configuration for event DBLRDY                */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000190) Publish configuration for event STOPPED               */
    __IM uint32_t RESERVED3[27];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED4[64];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED5[125];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable the quadrature decoder                         */
    __IOM uint32_t LEDPOL;                           /*!< (@ 0x00000504) LED output pin polarity                               */
    __IOM uint32_t SAMPLEPER;                        /*!< (@ 0x00000508) Sample period                                         */
    __IM int32_t  SAMPLE;                            /*!< (@ 0x0000050C) Motion sample value                                   */
    __IOM uint32_t REPORTPER;                        /*!< (@ 0x00000510) Number of samples to be taken before REPORTRDY and
                                                                         DBLRDY events can be generated*/
    __IM int32_t  ACC;                               /*!< (@ 0x00000514) Register accumulating the valid transitions           */
    __IM int32_t  ACCREAD;                           /*!< (@ 0x00000518) Snapshot of the ACC register, updated by the READCLRACC
                                                                         or RDCLRACC task*/
    __IOM NRF_QDEC_PSEL_Type PSEL;                   /*!< (@ 0x0000051C) (unspecified)                                         */
    __IOM uint32_t DBFEN;                            /*!< (@ 0x00000528) Enable input debounce filters                         */
    __IM uint32_t RESERVED6[5];
    __IOM uint32_t LEDPRE;                           /*!< (@ 0x00000540) Time period the LED is switched ON prior to sampling  */
    __IM uint32_t ACCDBL;                            /*!< (@ 0x00000544) Register accumulating the number of detected double
                                                                         transitions*/
    __IM uint32_t ACCDBLREAD;                        /*!< (@ 0x00000548) Snapshot of the ACCDBL, updated by the READCLRACC or
                                                                         RDCLRDBL task*/
  } NRF_QDEC_Type;                                   /*!< Size = 1356 (0x54C)                                                  */

/* QDEC_TASKS_START: Task starting the quadrature decoder */
  #define QDEC_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                 */

/* TASKS_START @Bit 0 : Task starting the quadrature decoder */
  #define QDEC_TASKS_START_TASKS_START_Pos (0UL)     /*!< Position of TASKS_START field.                                       */
  #define QDEC_TASKS_START_TASKS_START_Msk (0x1UL << QDEC_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.     */
  #define QDEC_TASKS_START_TASKS_START_Min (0x1UL)   /*!< Min enumerator value of TASKS_START field.                           */
  #define QDEC_TASKS_START_TASKS_START_Max (0x1UL)   /*!< Max enumerator value of TASKS_START field.                           */
  #define QDEC_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                       */


/* QDEC_TASKS_STOP: Task stopping the quadrature decoder */
  #define QDEC_TASKS_STOP_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Task stopping the quadrature decoder */
  #define QDEC_TASKS_STOP_TASKS_STOP_Pos (0UL)       /*!< Position of TASKS_STOP field.                                        */
  #define QDEC_TASKS_STOP_TASKS_STOP_Msk (0x1UL << QDEC_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.          */
  #define QDEC_TASKS_STOP_TASKS_STOP_Min (0x1UL)     /*!< Min enumerator value of TASKS_STOP field.                            */
  #define QDEC_TASKS_STOP_TASKS_STOP_Max (0x1UL)     /*!< Max enumerator value of TASKS_STOP field.                            */
  #define QDEC_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                         */


/* QDEC_TASKS_READCLRACC: Read and clear ACC and ACCDBL */
  #define QDEC_TASKS_READCLRACC_ResetValue (0x00000000UL) /*!< Reset value of TASKS_READCLRACC register.                       */

