NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event ADDRESS will publish to */
  #define RADIO_PUBLISH_ADDRESS_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_ADDRESS_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_ADDRESS_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RADIO_PUBLISH_ADDRESS_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_ADDRESS_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_ADDRESS_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_ADDRESS_EN_Msk (0x1UL << RADIO_PUBLISH_ADDRESS_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RADIO_PUBLISH_ADDRESS_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_ADDRESS_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_ADDRESS_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_ADDRESS_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_FRAMESTART: Publish configuration for event FRAMESTART */
  #define RADIO_PUBLISH_FRAMESTART_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_FRAMESTART register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event FRAMESTART will publish to */
  #define RADIO_PUBLISH_FRAMESTART_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_FRAMESTART_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_FRAMESTART_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RADIO_PUBLISH_FRAMESTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define RADIO_PUBLISH_FRAMESTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_FRAMESTART_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_FRAMESTART_EN_Msk (0x1UL << RADIO_PUBLISH_FRAMESTART_EN_Pos) /*!< Bit mask of EN field.                */
  #define RADIO_PUBLISH_FRAMESTART_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_FRAMESTART_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_FRAMESTART_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define RADIO_PUBLISH_FRAMESTART_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* RADIO_PUBLISH_PAYLOAD: Publish configuration for event PAYLOAD */
  #define RADIO_PUBLISH_PAYLOAD_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_PAYLOAD register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event PAYLOAD will publish to */
  #define RADIO_PUBLISH_PAYLOAD_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_PAYLOAD_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_PAYLOAD_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RADIO_PUBLISH_PAYLOAD_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_PAYLOAD_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_PAYLOAD_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_PAYLOAD_EN_Msk (0x1UL << RADIO_PUBLISH_PAYLOAD_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RADIO_PUBLISH_PAYLOAD_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_PAYLOAD_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_PAYLOAD_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_PAYLOAD_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_END: Publish configuration for event END */
  #define RADIO_PUBLISH_END_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_END register.                                */

/* CHIDX @Bits 0..7 : DPPI channel that event END will publish to */
  #define RADIO_PUBLISH_END_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_END_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_END_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define RADIO_PUBLISH_END_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_END_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_END_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_END_EN_Msk (0x1UL << RADIO_PUBLISH_END_EN_Pos) /*!< Bit mask of EN field.                              */
  #define RADIO_PUBLISH_END_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_END_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_END_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_END_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_PHYEND: Publish configuration for event PHYEND */
  #define RADIO_PUBLISH_PHYEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_PHYEND register.                          */

