NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* WOKENUP @Bit 0 : Write '1' to disable interrupt for event WOKENUP */
  #define RRAMC_INTENCLR_WOKENUP_Pos (0UL)           /*!< Position of WOKENUP field.                                           */
  #define RRAMC_INTENCLR_WOKENUP_Msk (0x1UL << RRAMC_INTENCLR_WOKENUP_Pos) /*!< Bit mask of WOKENUP field.                     */
  #define RRAMC_INTENCLR_WOKENUP_Min (0x0UL)         /*!< Min enumerator value of WOKENUP field.                               */
  #define RRAMC_INTENCLR_WOKENUP_Max (0x1UL)         /*!< Max enumerator value of WOKENUP field.                               */
  #define RRAMC_INTENCLR_WOKENUP_Clear (0x1UL)       /*!< Disable                                                              */
  #define RRAMC_INTENCLR_WOKENUP_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define RRAMC_INTENCLR_WOKENUP_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* READY @Bit 1 : Write '1' to disable interrupt for event READY */
  #define RRAMC_INTENCLR_READY_Pos (1UL)             /*!< Position of READY field.                                             */
  #define RRAMC_INTENCLR_READY_Msk (0x1UL << RRAMC_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                           */
  #define RRAMC_INTENCLR_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define RRAMC_INTENCLR_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define RRAMC_INTENCLR_READY_Clear (0x1UL)         /*!< Disable                                                              */
  #define RRAMC_INTENCLR_READY_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define RRAMC_INTENCLR_READY_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* READYNEXT @Bit 2 : Write '1' to disable interrupt for event READYNEXT */
  #define RRAMC_INTENCLR_READYNEXT_Pos (2UL)         /*!< Position of READYNEXT field.                                         */
  #define RRAMC_INTENCLR_READYNEXT_Msk (0x1UL << RRAMC_INTENCLR_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.               */
  #define RRAMC_INTENCLR_READYNEXT_Min (0x0UL)       /*!< Min enumerator value of READYNEXT field.                             */
  #define RRAMC_INTENCLR_READYNEXT_Max (0x1UL)       /*!< Max enumerator value of READYNEXT field.                             */
  #define RRAMC_INTENCLR_READYNEXT_Clear (0x1UL)     /*!< Disable                                                              */
  #define RRAMC_INTENCLR_READYNEXT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RRAMC_INTENCLR_READYNEXT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ACCESSERROR @Bit 3 : Write '1' to disable interrupt for event ACCESSERROR */
  #define RRAMC_INTENCLR_ACCESSERROR_Pos (3UL)       /*!< Position of ACCESSERROR field.                                       */
  #define RRAMC_INTENCLR_ACCESSERROR_Msk (0x1UL << RRAMC_INTENCLR_ACCESSERROR_Pos) /*!< Bit mask of ACCESSERROR field.         */
  #define RRAMC_INTENCLR_ACCESSERROR_Min (0x0UL)     /*!< Min enumerator value of ACCESSERROR field.                           */
  #define RRAMC_INTENCLR_ACCESSERROR_Max (0x1UL)     /*!< Max enumerator value of ACCESSERROR field.                           */
  #define RRAMC_INTENCLR_ACCESSERROR_Clear (0x1UL)   /*!< Disable                                                              */
  #define RRAMC_INTENCLR_ACCESSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RRAMC_INTENCLR_ACCESSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* RRAMC_INTPEND: Pending interrupts */
  #define RRAMC_INTPEND_ResetValue (0x00000000UL)    /*!< Reset value of INTPEND register.                                     */

/* WOKENUP @Bit 0 : Read pending status of interrupt for event WOKENUP */
  #define RRAMC_INTPEND_WOKENUP_Pos (0UL)            /*!< Position of WOKENUP field.                                           */
  #define RRAMC_INTPEND_WOKENUP_Msk (0x1UL << RRAMC_INTPEND_WOKENUP_Pos) /*!< Bit mask of WOKENUP field.                       */
  #define RRAMC_INTPEND_WOKENUP_Min (0x0UL)          /*!< Min enumerator value of WOKENUP field.                               */
  #define RRAMC_INTPEND_WOKENUP_Max (0x1UL)          /*!< Max enumerator value of WOKENUP field.                               */
  #define RRAMC_INTPEND_WOKENUP_NotPending (0x0UL)   /*!< Read: Not pending                                                    */
  #define RRAMC_INTPEND_WOKENUP_Pending (0x1UL)      /*!< Read: Pending                                                        */

/* READY @Bit 1 : Read pending status of interrupt for event READY */
  #define RRAMC_INTPEND_READY_Pos (1UL)              /*!< Position of READY field.                                             */
  #define RRAMC_INTPEND_READY_Msk (0x1UL << RRAMC_INTPEND_READY_Pos) /*!< Bit mask of READY field.                             */
  #define RRAMC_INTPEND_READY_Min (0x0UL)            /*!< Min enumerator value of READY field.                                 */
  #define RRAMC_INTPEND_READY_Max (0x1UL)            /*!< Max enumerator value of READY field.                                 */
  #define RRAMC_INTPEND_READY_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define RRAMC_INTPEND_READY_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* READYNEXT @Bit 2 : Read pending status of interrupt for event READYNEXT */
  #define RRAMC_INTPEND_READYNEXT_Pos (2UL)          /*!< Position of READYNEXT field.                                         */
  #define RRAMC_INTPEND_READYNEXT_Msk (0x1UL << RRAMC_INTPEND_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.                 */
  #define RRAMC_INTPEND_READYNEXT_Min (0x0UL)        /*!< Min enumerator value of READYNEXT field.                             */
  #define RRAMC_INTPEND_READYNEXT_Max (0x1UL)        /*!< Max enumerator value of READYNEXT field.                             */
  #define RRAMC_INTPEND_READYNEXT_NotPending (0x0UL) /*!< Read: Not pending                                                    */
  #define RRAMC_INTPEND_READYNEXT_Pending (0x1UL)    /*!< Read: Pending                                                        */

/* ACCESSERROR @Bit 3 : Read pending status of interrupt for event ACCESSERROR */
  #define RRAMC_INTPEND_ACCESSERROR_Pos (3UL)        /*!< Position of ACCESSERROR field.                                       */
  #define RRAMC_INTPEND_ACCESSERROR_Msk (0x1UL << RRAMC_INTPEND_ACCESSERROR_Pos) /*!< Bit mask of ACCESSERROR field.           */
  #define RRAMC_INTPEND_ACCESSERROR_Min (0x0UL)      /*!< Min enumerator value of ACCESSERROR field.                           */
  #define RRAMC_INTPEND_ACCESSERROR_Max (0x1UL)      /*!< Max enumerator value of ACCESSERROR field.                           */
  #define RRAMC_INTPEND_ACCESSERROR_NotPending (0x0UL) /*!< Read: Not pending                                                  */
  #define RRAMC_INTPEND_ACCESSERROR_Pending (0x1UL)  /*!< Read: Pending                                                        */


/* RRAMC_READY: RRAMC ready status */
  #define RRAMC_READY_ResetValue (0x00000000UL)      /*!< Reset value of READY register.                                       */

/* READY @Bit 0 : RRAMC is ready or busy */
  #define RRAMC_READY_READY_Pos (0UL)                /*!< Position of READY field.                                             */
  #define RRAMC_READY_READY_Msk (0x1UL << RRAMC_READY_READY_Pos) /*!< Bit mask of READY field.                                 */
  #define RRAMC_READY_READY_Min (0x0UL)              /*!< Min enumerator value of READY field.                                 */
  #define RRAMC_READY_READY_Max (0x1UL)              /*!< Max enumerator value of READY field.                                 */
  #define RRAMC_READY_READY_Busy (0x0UL)             /*!< RRAMC is busy                                                        */
  #define RRAMC_READY_READY_Ready (0x1UL)            /*!< The current RRAMC operation is completed and RRAMC is ready          */


/* RRAMC_READYNEXT: Ready next flag */
  #define RRAMC_READYNEXT_ResetValue (0x00000000UL)  /*!< Reset value of READYNEXT register.                                   */

/* READYNEXT @Bit 0 : RRAMC can accept a new write operation */
  #define RRAMC_READYNEXT_READYNEXT_Pos (0UL)        /*!< Position of READYNEXT field.                                         */
  #define RRAMC_READYNEXT_READYNEXT_Msk (0x1UL << RRAMC_READYNEXT_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.             */
  #define RRAMC_READYNEXT_READYNEXT_Min (0x0UL)      /*!< Min enumerator value of READYNEXT field.                             */
  #define RRAMC_READYNEXT_READYNEXT_Max (0x1UL)      /*!< Max enumerator value of READYNEXT field.                             */
  #define RRAMC_READYNEXT_READYNEXT_Busy (0x0UL)     /*!< RRAMC cannot accept any write operation now                          */
  #define RRAMC_READYNEXT_READYNEXT_Ready (0x1UL)    /*!< RRAMC is ready to accept a new write operation                       */


