NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* CALIBRATEDONE @Bit 4 : Write '1' to enable interrupt for event CALIBRATEDONE */
  #define SAADC_INTENSET_CALIBRATEDONE_Pos (4UL)     /*!< Position of CALIBRATEDONE field.                                     */
  #define SAADC_INTENSET_CALIBRATEDONE_Msk (0x1UL << SAADC_INTENSET_CALIBRATEDONE_Pos) /*!< Bit mask of CALIBRATEDONE field.   */
  #define SAADC_INTENSET_CALIBRATEDONE_Min (0x0UL)   /*!< Min enumerator value of CALIBRATEDONE field.                         */
  #define SAADC_INTENSET_CALIBRATEDONE_Max (0x1UL)   /*!< Max enumerator value of CALIBRATEDONE field.                         */
  #define SAADC_INTENSET_CALIBRATEDONE_Set (0x1UL)   /*!< Enable                                                               */
  #define SAADC_INTENSET_CALIBRATEDONE_Disabled (0x0UL) /*!< Read: Disabled                                                    */
  #define SAADC_INTENSET_CALIBRATEDONE_Enabled (0x1UL) /*!< Read: Enabled                                                      */

/* STOPPED @Bit 5 : Write '1' to enable interrupt for event STOPPED */
  #define SAADC_INTENSET_STOPPED_Pos (5UL)           /*!< Position of STOPPED field.                                           */
  #define SAADC_INTENSET_STOPPED_Msk (0x1UL << SAADC_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                     */
  #define SAADC_INTENSET_STOPPED_Min (0x0UL)         /*!< Min enumerator value of STOPPED field.                               */
  #define SAADC_INTENSET_STOPPED_Max (0x1UL)         /*!< Max enumerator value of STOPPED field.                               */
  #define SAADC_INTENSET_STOPPED_Set (0x1UL)         /*!< Enable                                                               */
  #define SAADC_INTENSET_STOPPED_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_STOPPED_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* CH0LIMITH @Bit 6 : Write '1' to enable interrupt for event CH0LIMITH */
  #define SAADC_INTENSET_CH0LIMITH_Pos (6UL)         /*!< Position of CH0LIMITH field.                                         */
  #define SAADC_INTENSET_CH0LIMITH_Msk (0x1UL << SAADC_INTENSET_CH0LIMITH_Pos) /*!< Bit mask of CH0LIMITH field.               */
  #define SAADC_INTENSET_CH0LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH0LIMITH field.                             */
  #define SAADC_INTENSET_CH0LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH0LIMITH field.                             */
  #define SAADC_INTENSET_CH0LIMITH_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH0LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH0LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH0LIMITL @Bit 7 : Write '1' to enable interrupt for event CH0LIMITL */
  #define SAADC_INTENSET_CH0LIMITL_Pos (7UL)         /*!< Position of CH0LIMITL field.                                         */
  #define SAADC_INTENSET_CH0LIMITL_Msk (0x1UL << SAADC_INTENSET_CH0LIMITL_Pos) /*!< Bit mask of CH0LIMITL field.               */
  #define SAADC_INTENSET_CH0LIMITL_Min (0x0UL)       /*!< Min enumerator value of CH0LIMITL field.                             */
  #define SAADC_INTENSET_CH0LIMITL_Max (0x1UL)       /*!< Max enumerator value of CH0LIMITL field.                             */
  #define SAADC_INTENSET_CH0LIMITL_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH0LIMITL_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH0LIMITL_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH1LIMITH @Bit 8 : Write '1' to enable interrupt for event CH1LIMITH */
  #define SAADC_INTENSET_CH1LIMITH_Pos (8UL)         /*!< Position of CH1LIMITH field.                                         */
  #define SAADC_INTENSET_CH1LIMITH_Msk (0x1UL << SAADC_INTENSET_CH1LIMITH_Pos) /*!< Bit mask of CH1LIMITH field.               */
  #define SAADC_INTENSET_CH1LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH1LIMITH field.                             */
  #define SAADC_INTENSET_CH1LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH1LIMITH field.                             */
  #define SAADC_INTENSET_CH1LIMITH_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH1LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH1LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH1LIMITL @Bit 9 : Write '1' to enable interrupt for event CH1LIMITL */
  #define SAADC_INTENSET_CH1LIMITL_Pos (9UL)         /*!< Position of CH1LIMITL field.                                         */
  #define SAADC_INTENSET_CH1LIMITL_Msk (0x1UL << SAADC_INTENSET_CH1LIMITL_Pos) /*!< Bit mask of CH1LIMITL field.               */
  #define SAADC_INTENSET_CH1LIMITL_Min (0x0UL)       /*!< Min enumerator value of CH1LIMITL field.                             */
  #define SAADC_INTENSET_CH1LIMITL_Max (0x1UL)       /*!< Max enumerator value of CH1LIMITL field.                             */
  #define SAADC_INTENSET_CH1LIMITL_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH1LIMITL_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH1LIMITL_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH2LIMITH @Bit 10 : Write '1' to enable interrupt for event CH2LIMITH */
  #define SAADC_INTENSET_CH2LIMITH_Pos (10UL)        /*!< Position of CH2LIMITH field.                                         */
  #define SAADC_INTENSET_CH2LIMITH_Msk (0x1UL << SAADC_INTENSET_CH2LIMITH_Pos) /*!< Bit mask of CH2LIMITH field.               */
  #define SAADC_INTENSET_CH2LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH2LIMITH field.                             */
  #define SAADC_INTENSET_CH2LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH2LIMITH field.                             */
  #define SAADC_INTENSET_CH2LIMITH_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH2LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH2LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH2LIMITL @Bit 11 : Write '1' to enable interrupt for event CH2LIMITL */
  #define SAADC_INTENSET_CH2LIMITL_Pos (11UL)        /*!< Position of CH2LIMITL field.                                         */
  #define SAADC_INTENSET_CH2LIMITL_Msk (0x1UL << SAADC_INTENSET_CH2LIMITL_Pos) /*!< Bit mask of CH2LIMITL field.               */
  #define SAADC_INTENSET_CH2LIMITL_Min (0x0UL)       /*!< Min enumerator value of CH2LIMITL field.                             */
  #define SAADC_INTENSET_CH2LIMITL_Max (0x1UL)       /*!< Max enumerator value of CH2LIMITL field.                             */
  #define SAADC_INTENSET_CH2LIMITL_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH2LIMITL_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH2LIMITL_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH3LIMITH @Bit 12 : Write '1' to enable interrupt for event CH3LIMITH */
  #define SAADC_INTENSET_CH3LIMITH_Pos (12UL)        /*!< Position of CH3LIMITH field.                                         */
  #define SAADC_INTENSET_CH3LIMITH_Msk (0x1UL << SAADC_INTENSET_CH3LIMITH_Pos) /*!< Bit mask of CH3LIMITH field.               */
  #define SAADC_INTENSET_CH3LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH3LIMITH field.                             */
  #define SAADC_INTENSET_CH3LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH3LIMITH field.                             */
  #define SAADC_INTENSET_CH3LIMITH_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH3LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH3LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH3LIMITL @Bit 13 : Write '1' to enable interrupt for event CH3LIMITL */
  #define SAADC_INTENSET_CH3LIMITL_Pos (13UL)        /*!< Position of CH3LIMITL field.                                         */
  #define SAADC_INTENSET_CH3LIMITL_Msk (0x1UL << SAADC_INTENSET_CH3LIMITL_Pos) /*!< Bit mask of CH3LIMITL field.               */
  #define SAADC_INTENSET_CH3LIMITL_Min (0x0UL)       /*!< Min enumerator value of CH3LIMITL field.                             */
  #define SAADC_INTENSET_CH3LIMITL_Max (0x1UL)       /*!< Max enumerator value of CH3LIMITL field.                             */
  #define SAADC_INTENSET_CH3LIMITL_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH3LIMITL_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH3LIMITL_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH4LIMITH @Bit 14 : Write '1' to enable interrupt for event CH4LIMITH */
  #define SAADC_INTENSET_CH4LIMITH_Pos (14UL)        /*!< Position of CH4LIMITH field.                                         */
  #define SAADC_INTENSET_CH4LIMITH_Msk (0x1UL << SAADC_INTENSET_CH4LIMITH_Pos) /*!< Bit mask of CH4LIMITH field.               */
  #define SAADC_INTENSET_CH4LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH4LIMITH field.                             */
  #define SAADC_INTENSET_CH4LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH4LIMITH field.                             */
  #define SAADC_INTENSET_CH4LIMITH_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH4LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH4LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH4LIMITL @Bit 15 : Write '1' to enable interrupt for event CH4LIMITL */
  #define SAADC_INTENSET_CH4LIMITL_Pos (15UL)        /*!< Position of CH4LIMITL field.                                         */
  #define SAADC_INTENSET_CH4LIMITL_Msk (0x1UL << SAADC_INTENSET_CH4LIMITL_Pos) /*!< Bit mask of CH4LIMITL field.               */
  #define SAADC_INTENSET_CH4LIMITL_Min (0x0UL)       /*!< Min enumerator value of CH4LIMITL field.                             */
  #define SAADC_INTENSET_CH4LIMITL_Max (0x1UL)       /*!< Max enumerator value of CH4LIMITL field.                             */
  #define SAADC_INTENSET_CH4LIMITL_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH4LIMITL_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH4LIMITL_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH5LIMITH @Bit 16 : Write '1' to enable interrupt for event CH5LIMITH */
  #define SAADC_INTENSET_CH5LIMITH_Pos (16UL)        /*!< Position of CH5LIMITH field.                                         */
  #define SAADC_INTENSET_CH5LIMITH_Msk (0x1UL << SAADC_INTENSET_CH5LIMITH_Pos) /*!< Bit mask of CH5LIMITH field.               */
  #define SAADC_INTENSET_CH5LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH5LIMITH field.                             */
  #define SAADC_INTENSET_CH5LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH5LIMITH field.                             */
  #define SAADC_INTENSET_CH5LIMITH_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH5LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH5LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH5LIMITL @Bit 17 : Write '1' to enable interrupt for event CH5LIMITL */
  #define SAADC_INTENSET_CH5LIMITL_Pos (17UL)        /*!< Position of CH5LIMITL field.                                         */
  #define SAADC_INTENSET_CH5LIMITL_Msk (0x1UL << SAADC_INTENSET_CH5LIMITL_Pos) /*!< Bit mask of CH5LIMITL field.               */
  #define SAADC_INTENSET_CH5LIMITL_Min (0x0UL)       /*!< Min enumerator value of CH5LIMITL field.                             */
  #define SAADC_INTENSET_CH5LIMITL_Max (0x1UL)       /*!< Max enumerator value of CH5LIMITL field.                             */
  #define SAADC_INTENSET_CH5LIMITL_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH5LIMITL_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH5LIMITL_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH6LIMITH @Bit 18 : Write '1' to enable interrupt for event CH6LIMITH */
  #define SAADC_INTENSET_CH6LIMITH_Pos (18UL)        /*!< Position of CH6LIMITH field.                                         */
  #define SAADC_INTENSET_CH6LIMITH_Msk (0x1UL << SAADC_INTENSET_CH6LIMITH_Pos) /*!< Bit mask of CH6LIMITH field.               */
  #define SAADC_INTENSET_CH6LIMITH_Min (0x0UL)       /*!< Min enumerator value of CH6LIMITH field.                             */
  #define SAADC_INTENSET_CH6LIMITH_Max (0x1UL)       /*!< Max enumerator value of CH6LIMITH field.                             */
  #define SAADC_INTENSET_CH6LIMITH_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH6LIMITH_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH6LIMITH_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CH6LIMITL @Bit 19 : Write '1' to enable interrupt for event CH6LIMITL */
  #define SAADC_INTENSET_CH6LIMITL_Pos (19UL)        /*!< Position of CH6LIMITL field.                                         */
  #define SAADC_INTENSET_CH6LIMITL_Msk (0x1UL << SAADC_INTENSET_CH6LIMITL_Pos) /*!< Bit mask of CH6LIMITL field.               */
  #define SAADC_INTENSET_CH6LIMITL_Min (0x0UL)       /*!< Min enumerator value of CH6LIMITL field.                             */
  #define SAADC_INTENSET_CH6LIMITL_Max (0x1UL)       /*!< Max enumerator value of CH6LIMITL field.                             */
  #define SAADC_INTENSET_CH6LIMITL_Set (0x1UL)       /*!< Enable                                                               */
  #define SAADC_INTENSET_CH6LIMITL_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define SAADC_INTENSET_CH6LIMITL_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

