NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* STOPPED @Bit 1 : Enable or disable interrupt for event STOPPED */
  #define TWIS_INTEN_STOPPED_Pos (1UL)               /*!< Position of STOPPED field.                                           */
  #define TWIS_INTEN_STOPPED_Msk (0x1UL << TWIS_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                             */
  #define TWIS_INTEN_STOPPED_Min (0x0UL)             /*!< Min enumerator value of STOPPED field.                               */
  #define TWIS_INTEN_STOPPED_Max (0x1UL)             /*!< Max enumerator value of STOPPED field.                               */
  #define TWIS_INTEN_STOPPED_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TWIS_INTEN_STOPPED_Enabled (0x1UL)         /*!< Enable                                                               */

/* ERROR @Bit 5 : Enable or disable interrupt for event ERROR */
  #define TWIS_INTEN_ERROR_Pos (5UL)                 /*!< Position of ERROR field.                                             */
  #define TWIS_INTEN_ERROR_Msk (0x1UL << TWIS_INTEN_ERROR_Pos) /*!< Bit mask of ERROR field.                                   */
  #define TWIS_INTEN_ERROR_Min (0x0UL)               /*!< Min enumerator value of ERROR field.                                 */
  #define TWIS_INTEN_ERROR_Max (0x1UL)               /*!< Max enumerator value of ERROR field.                                 */
  #define TWIS_INTEN_ERROR_Disabled (0x0UL)          /*!< Disable                                                              */
  #define TWIS_INTEN_ERROR_Enabled (0x1UL)           /*!< Enable                                                               */

/* WRITE @Bit 15 : Enable or disable interrupt for event WRITE */
  #define TWIS_INTEN_WRITE_Pos (15UL)                /*!< Position of WRITE field.                                             */
  #define TWIS_INTEN_WRITE_Msk (0x1UL << TWIS_INTEN_WRITE_Pos) /*!< Bit mask of WRITE field.                                   */
  #define TWIS_INTEN_WRITE_Min (0x0UL)               /*!< Min enumerator value of WRITE field.                                 */
  #define TWIS_INTEN_WRITE_Max (0x1UL)               /*!< Max enumerator value of WRITE field.                                 */
  #define TWIS_INTEN_WRITE_Disabled (0x0UL)          /*!< Disable                                                              */
  #define TWIS_INTEN_WRITE_Enabled (0x1UL)           /*!< Enable                                                               */

/* READ @Bit 16 : Enable or disable interrupt for event READ */
  #define TWIS_INTEN_READ_Pos (16UL)                 /*!< Position of READ field.                                              */
  #define TWIS_INTEN_READ_Msk (0x1UL << TWIS_INTEN_READ_Pos) /*!< Bit mask of READ field.                                      */
  #define TWIS_INTEN_READ_Min (0x0UL)                /*!< Min enumerator value of READ field.                                  */
  #define TWIS_INTEN_READ_Max (0x1UL)                /*!< Max enumerator value of READ field.                                  */
  #define TWIS_INTEN_READ_Disabled (0x0UL)           /*!< Disable                                                              */
  #define TWIS_INTEN_READ_Enabled (0x1UL)            /*!< Enable                                                               */

/* DMARXEND @Bit 19 : Enable or disable interrupt for event DMARXEND */
  #define TWIS_INTEN_DMARXEND_Pos (19UL)             /*!< Position of DMARXEND field.                                          */
  #define TWIS_INTEN_DMARXEND_Msk (0x1UL << TWIS_INTEN_DMARXEND_Pos) /*!< Bit mask of DMARXEND field.                          */
  #define TWIS_INTEN_DMARXEND_Min (0x0UL)            /*!< Min enumerator value of DMARXEND field.                              */
  #define TWIS_INTEN_DMARXEND_Max (0x1UL)            /*!< Max enumerator value of DMARXEND field.                              */
  #define TWIS_INTEN_DMARXEND_Disabled (0x0UL)       /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXEND_Enabled (0x1UL)        /*!< Enable                                                               */

/* DMARXREADY @Bit 20 : Enable or disable interrupt for event DMARXREADY */
  #define TWIS_INTEN_DMARXREADY_Pos (20UL)           /*!< Position of DMARXREADY field.                                        */
  #define TWIS_INTEN_DMARXREADY_Msk (0x1UL << TWIS_INTEN_DMARXREADY_Pos) /*!< Bit mask of DMARXREADY field.                    */
  #define TWIS_INTEN_DMARXREADY_Min (0x0UL)          /*!< Min enumerator value of DMARXREADY field.                            */
  #define TWIS_INTEN_DMARXREADY_Max (0x1UL)          /*!< Max enumerator value of DMARXREADY field.                            */
  #define TWIS_INTEN_DMARXREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* DMARXBUSERROR @Bit 21 : Enable or disable interrupt for event DMARXBUSERROR */
  #define TWIS_INTEN_DMARXBUSERROR_Pos (21UL)        /*!< Position of DMARXBUSERROR field.                                     */
  #define TWIS_INTEN_DMARXBUSERROR_Msk (0x1UL << TWIS_INTEN_DMARXBUSERROR_Pos) /*!< Bit mask of DMARXBUSERROR field.           */
  #define TWIS_INTEN_DMARXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of DMARXBUSERROR field.                         */
  #define TWIS_INTEN_DMARXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of DMARXBUSERROR field.                         */
  #define TWIS_INTEN_DMARXBUSERROR_Disabled (0x0UL)  /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXBUSERROR_Enabled (0x1UL)   /*!< Enable                                                               */

/* DMARXMATCH0 @Bit 22 : Enable or disable interrupt for event DMARXMATCH[0] */
  #define TWIS_INTEN_DMARXMATCH0_Pos (22UL)          /*!< Position of DMARXMATCH0 field.                                       */
  #define TWIS_INTEN_DMARXMATCH0_Msk (0x1UL << TWIS_INTEN_DMARXMATCH0_Pos) /*!< Bit mask of DMARXMATCH0 field.                 */
  #define TWIS_INTEN_DMARXMATCH0_Min (0x0UL)         /*!< Min enumerator value of DMARXMATCH0 field.                           */
  #define TWIS_INTEN_DMARXMATCH0_Max (0x1UL)         /*!< Max enumerator value of DMARXMATCH0 field.                           */
  #define TWIS_INTEN_DMARXMATCH0_Disabled (0x0UL)    /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXMATCH0_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMARXMATCH1 @Bit 23 : Enable or disable interrupt for event DMARXMATCH[1] */
  #define TWIS_INTEN_DMARXMATCH1_Pos (23UL)          /*!< Position of DMARXMATCH1 field.                                       */
  #define TWIS_INTEN_DMARXMATCH1_Msk (0x1UL << TWIS_INTEN_DMARXMATCH1_Pos) /*!< Bit mask of DMARXMATCH1 field.                 */
  #define TWIS_INTEN_DMARXMATCH1_Min (0x0UL)         /*!< Min enumerator value of DMARXMATCH1 field.                           */
  #define TWIS_INTEN_DMARXMATCH1_Max (0x1UL)         /*!< Max enumerator value of DMARXMATCH1 field.                           */
  #define TWIS_INTEN_DMARXMATCH1_Disabled (0x0UL)    /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXMATCH1_Enabled (0x1UL)     /*!< Enable                                                               */

