NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* PARITY @Bits 1..3 : Parity */
  #define UARTE_CONFIG_PARITY_Pos (1UL)              /*!< Position of PARITY field.                                            */
  #define UARTE_CONFIG_PARITY_Msk (0x7UL << UARTE_CONFIG_PARITY_Pos) /*!< Bit mask of PARITY field.                            */
  #define UARTE_CONFIG_PARITY_Min (0x0UL)            /*!< Min enumerator value of PARITY field.                                */
  #define UARTE_CONFIG_PARITY_Max (0x7UL)            /*!< Max enumerator value of PARITY field.                                */
  #define UARTE_CONFIG_PARITY_Excluded (0x0UL)       /*!< Exclude parity bit                                                   */
  #define UARTE_CONFIG_PARITY_Included (0x7UL)       /*!< Include parity bit                                                   */

/* STOP @Bit 4 : Stop bits */
  #define UARTE_CONFIG_STOP_Pos (4UL)                /*!< Position of STOP field.                                              */
  #define UARTE_CONFIG_STOP_Msk (0x1UL << UARTE_CONFIG_STOP_Pos) /*!< Bit mask of STOP field.                                  */
  #define UARTE_CONFIG_STOP_Min (0x0UL)              /*!< Min enumerator value of STOP field.                                  */
  #define UARTE_CONFIG_STOP_Max (0x1UL)              /*!< Max enumerator value of STOP field.                                  */
  #define UARTE_CONFIG_STOP_One (0x0UL)              /*!< One stop bit                                                         */
  #define UARTE_CONFIG_STOP_Two (0x1UL)              /*!< Two stop bits                                                        */

/* PARITYTYPE @Bit 8 : Even or odd parity type */
  #define UARTE_CONFIG_PARITYTYPE_Pos (8UL)          /*!< Position of PARITYTYPE field.                                        */
  #define UARTE_CONFIG_PARITYTYPE_Msk (0x1UL << UARTE_CONFIG_PARITYTYPE_Pos) /*!< Bit mask of PARITYTYPE field.                */
  #define UARTE_CONFIG_PARITYTYPE_Min (0x0UL)        /*!< Min enumerator value of PARITYTYPE field.                            */
  #define UARTE_CONFIG_PARITYTYPE_Max (0x1UL)        /*!< Max enumerator value of PARITYTYPE field.                            */
  #define UARTE_CONFIG_PARITYTYPE_Even (0x0UL)       /*!< Even parity                                                          */
  #define UARTE_CONFIG_PARITYTYPE_Odd (0x1UL)        /*!< Odd parity                                                           */

/* FRAMESIZE @Bits 9..12 : Set the data frame size */
  #define UARTE_CONFIG_FRAMESIZE_Pos (9UL)           /*!< Position of FRAMESIZE field.                                         */
  #define UARTE_CONFIG_FRAMESIZE_Msk (0xFUL << UARTE_CONFIG_FRAMESIZE_Pos) /*!< Bit mask of FRAMESIZE field.                   */
  #define UARTE_CONFIG_FRAMESIZE_Min (0x4UL)         /*!< Min enumerator value of FRAMESIZE field.                             */
  #define UARTE_CONFIG_FRAMESIZE_Max (0x9UL)         /*!< Max enumerator value of FRAMESIZE field.                             */
  #define UARTE_CONFIG_FRAMESIZE_9bit (0x9UL)        /*!< 9 bit data frame size. 9th bit is treated as address bit.            */
  #define UARTE_CONFIG_FRAMESIZE_8bit (0x8UL)        /*!< 8 bit data frame size.                                               */
  #define UARTE_CONFIG_FRAMESIZE_7bit (0x7UL)        /*!< 7 bit data frame size.                                               */
  #define UARTE_CONFIG_FRAMESIZE_6bit (0x6UL)        /*!< 6 bit data frame size.                                               */
  #define UARTE_CONFIG_FRAMESIZE_5bit (0x5UL)        /*!< 5 bit data frame size.                                               */
  #define UARTE_CONFIG_FRAMESIZE_4bit (0x4UL)        /*!< 4 bit data frame size.                                               */

/* ENDIAN @Bit 13 : Select if data is trimmed from MSB or LSB end when the data frame size is less than 8. */
  #define UARTE_CONFIG_ENDIAN_Pos (13UL)             /*!< Position of ENDIAN field.                                            */
  #define UARTE_CONFIG_ENDIAN_Msk (0x1UL << UARTE_CONFIG_ENDIAN_Pos) /*!< Bit mask of ENDIAN field.                            */
  #define UARTE_CONFIG_ENDIAN_Min (0x0UL)            /*!< Min enumerator value of ENDIAN field.                                */
  #define UARTE_CONFIG_ENDIAN_Max (0x1UL)            /*!< Max enumerator value of ENDIAN field.                                */
  #define UARTE_CONFIG_ENDIAN_MSB (0x0UL)            /*!< Data is trimmed from MSB end.                                        */
  #define UARTE_CONFIG_ENDIAN_LSB (0x1UL)            /*!< Data is trimmed from LSB end.                                        */

/* FRAMETIMEOUT @Bit 14 : Enable packet timeout. */
  #define UARTE_CONFIG_FRAMETIMEOUT_Pos (14UL)       /*!< Position of FRAMETIMEOUT field.                                      */
  #define UARTE_CONFIG_FRAMETIMEOUT_Msk (0x1UL << UARTE_CONFIG_FRAMETIMEOUT_Pos) /*!< Bit mask of FRAMETIMEOUT field.          */
  #define UARTE_CONFIG_FRAMETIMEOUT_Min (0x0UL)      /*!< Min enumerator value of FRAMETIMEOUT field.                          */
  #define UARTE_CONFIG_FRAMETIMEOUT_Max (0x1UL)      /*!< Max enumerator value of FRAMETIMEOUT field.                          */
  #define UARTE_CONFIG_FRAMETIMEOUT_DISABLED (0x0UL) /*!< Packet timeout is disabled.                                          */
  #define UARTE_CONFIG_FRAMETIMEOUT_ENABLED (0x1UL)  /*!< Packet timeout is enabled.                                           */
  #define UARTE_CONFIG_FRAMETIMEOUT_Disabled (0x0UL) /*!< Packet timeout is disabled.                                          */
  #define UARTE_CONFIG_FRAMETIMEOUT_Enabled (0x1UL)  /*!< Packet timeout is enabled.                                           */


/* UARTE_ADDRESS: Set the address of the UARTE for RX when used in 9 bit data frame mode. */
  #define UARTE_ADDRESS_ResetValue (0x00000000UL)    /*!< Reset value of ADDRESS register.                                     */

/* ADDRESS @Bits 0..7 : Set address */
  #define UARTE_ADDRESS_ADDRESS_Pos (0UL)            /*!< Position of ADDRESS field.                                           */
  #define UARTE_ADDRESS_ADDRESS_Msk (0xFFUL << UARTE_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.                      */


/* UARTE_FRAMETIMEOUT: Set the number of UARTE bits to count before triggering packet timeout. */
  #define UARTE_FRAMETIMEOUT_ResetValue (0x00000010UL) /*!< Reset value of FRAMETIMEOUT register.                              */

/* COUNTERTOP @Bits 0..9 : Number of UARTE bits before timeout. */
  #define UARTE_FRAMETIMEOUT_COUNTERTOP_Pos (0UL)    /*!< Position of COUNTERTOP field.                                        */
  #define UARTE_FRAMETIMEOUT_COUNTERTOP_Msk (0x3FFUL << UARTE_FRAMETIMEOUT_COUNTERTOP_Pos) /*!< Bit mask of COUNTERTOP field.  */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           UICR                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct UICR_APPROTECT ================================================== */
/**
  * @brief APPROTECT [UICR_APPROTECT] Access Port Protection Registers
  */
typedef struct {
  __IOM uint32_t  PROTECT0;                          /*!< (@ 0x00000000) Access port protection                                */
  __IM  uint32_t  RESERVED[6];
  __IOM uint32_t  PROTECT1;                          /*!< (@ 0x0000001C) Access port protection                                */
} NRF_UICR_APPROTECT_Type;                           /*!< Size = 32 (0x020)                                                    */
  #define UICR_APPROTECT_MaxCount (1UL)              /*!< Size of APPROTECT[1] array.                                          */
  #define UICR_APPROTECT_MaxIndex (0UL)              /*!< Max index of APPROTECT[1] array.                                     */
  #define UICR_APPROTECT_MinIndex (0UL)              /*!< Min index of APPROTECT[1] array.                                     */

/* UICR_APPROTECT_PROTECT0: Access port protection */
  #define UICR_APPROTECT_PROTECT0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROTECT0 register.                             */

/* PALL @Bits 0..31 : (unspecified) */
  #define UICR_APPROTECT_PROTECT0_PALL_Pos (0UL)     /*!< Position of PALL field.                                              */
  #define UICR_APPROTECT_PROTECT0_PALL_Msk (0xFFFFFFFFUL << UICR_APPROTECT_PROTECT0_PALL_Pos) /*!< Bit mask of PALL field.     */
  #define UICR_APPROTECT_PROTECT0_PALL_Min (0xFFFFFFFFUL) /*!< Min enumerator value of PALL field.                             */
  #define UICR_APPROTECT_PROTECT0_PALL_Max (0xFFFFFFFFUL) /*!< Max enumerator value of PALL field.                             */
  #define UICR_APPROTECT_PROTECT0_PALL_Unprotected (0xFFFFFFFFUL) /*!< Leaves TAMPC PROTECT.DOMAIN DBGEN and NIDEN signal
                                                                       protectors unlocked and under CPU control.*/


