NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* DATA0 @Bits 0..31 : Abstract Data 0 */
  #define VPR_DEBUGIF_DATA0_DATA0_Pos (0UL)          /*!< Position of DATA0 field.                                             */
  #define VPR_DEBUGIF_DATA0_DATA0_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_DATA0_DATA0_Pos) /*!< Bit mask of DATA0 field.              */


/* VPR_DEBUGIF_DATA1: Abstract Data 1. Read/write data for argument 1 */
  #define VPR_DEBUGIF_DATA1_ResetValue (0x00000000UL) /*!< Reset value of DATA1 register.                                      */

/* DATA1 @Bits 0..31 : Abstract Data 1 */
  #define VPR_DEBUGIF_DATA1_DATA1_Pos (0UL)          /*!< Position of DATA1 field.                                             */
  #define VPR_DEBUGIF_DATA1_DATA1_Msk (0xFFFFFFFFUL << VPR_DEBUGIF_DATA1_DATA1_Pos) /*!< Bit mask of DATA1 field.              */


/* VPR_DEBUGIF_DMCONTROL: Debug Module Control */
  #define VPR_DEBUGIF_DMCONTROL_ResetValue (0x00000000UL) /*!< Reset value of DMCONTROL register.                              */

/* DMACTIVE @Bit 0 : Reset signal for the debug module. */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos (0UL)   /*!< Position of DMACTIVE field.                                          */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_DMACTIVE_Pos) /*!< Bit mask of DMACTIVE field.    */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Min (0x0UL) /*!< Min enumerator value of DMACTIVE field.                              */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Max (0x1UL) /*!< Max enumerator value of DMACTIVE field.                              */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Disabled (0x0UL) /*!< Reset the debug module itself                                   */
  #define VPR_DEBUGIF_DMCONTROL_DMACTIVE_Enabled (0x1UL) /*!< Normal operation                                                 */

/* NDMRESET @Bit 1 : Reset signal output from the debug module to the system. */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Pos (1UL)   /*!< Position of NDMRESET field.                                          */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_NDMRESET_Pos) /*!< Bit mask of NDMRESET field.    */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Min (0x0UL) /*!< Min enumerator value of NDMRESET field.                              */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Max (0x1UL) /*!< Max enumerator value of NDMRESET field.                              */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Inactive (0x0UL) /*!< Reset inactive                                                  */
  #define VPR_DEBUGIF_DMCONTROL_NDMRESET_Active (0x1UL) /*!< Reset active                                                      */

/* CLRRESETHALTREQ @Bit 2 : Clear the halt on reset request. */
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Pos (2UL) /*!< Position of CLRRESETHALTREQ field.                              */
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Pos) /*!< Bit mask of
                                                                            CLRRESETHALTREQ field.*/
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Min (0x0UL) /*!< Min enumerator value of CLRRESETHALTREQ field.                */
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Max (0x1UL) /*!< Max enumerator value of CLRRESETHALTREQ field.                */
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_NoOperation (0x0UL) /*!< No operation when written 0.                          */
  #define VPR_DEBUGIF_DMCONTROL_CLRRESETHALTREQ_Clear (0x1UL) /*!< Clears the halt on reset request                            */

/* SETRESETHALTREQ @Bit 3 : Set the halt on reset request. */
  #define VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_Pos (3UL) /*!< Position of SETRESETHALTREQ field.                              */
  #define VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_Pos) /*!< Bit mask of
                                                                            SETRESETHALTREQ field.*/
  #define VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_Min (0x0UL) /*!< Min enumerator value of SETRESETHALTREQ field.                */
  #define VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_Max (0x1UL) /*!< Max enumerator value of SETRESETHALTREQ field.                */
  #define VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_NoOperation (0x0UL) /*!< No operation when written 0.                          */
  #define VPR_DEBUGIF_DMCONTROL_SETRESETHALTREQ_Clear (0x1UL) /*!< Sets the halt on reset request                              */

/* HARTSELHI @Bits 6..15 : The high 10 bits of hartsel. */
  #define VPR_DEBUGIF_DMCONTROL_HARTSELHI_Pos (6UL)  /*!< Position of HARTSELHI field.                                         */
  #define VPR_DEBUGIF_DMCONTROL_HARTSELHI_Msk (0x3FFUL << VPR_DEBUGIF_DMCONTROL_HARTSELHI_Pos) /*!< Bit mask of HARTSELHI
                                                                            field.*/

/* HARTSELLO @Bits 16..25 : The low 10 bits of hartsel. */
  #define VPR_DEBUGIF_DMCONTROL_HARTSELLO_Pos (16UL) /*!< Position of HARTSELLO field.                                         */
  #define VPR_DEBUGIF_DMCONTROL_HARTSELLO_Msk (0x3FFUL << VPR_DEBUGIF_DMCONTROL_HARTSELLO_Pos) /*!< Bit mask of HARTSELLO
                                                                            field.*/

/* HASEL @Bit 26 : Definition of currently selected harts. */
  #define VPR_DEBUGIF_DMCONTROL_HASEL_Pos (26UL)     /*!< Position of HASEL field.                                             */
  #define VPR_DEBUGIF_DMCONTROL_HASEL_Msk (0x1UL << VPR_DEBUGIF_DMCONTROL_HASEL_Pos) /*!< Bit mask of HASEL field.             */
  #define VPR_DEBUGIF_DMCONTROL_HASEL_Min (0x0UL)    /*!< Min enumerator value of HASEL field.                                 */
  #define VPR_DEBUGIF_DMCONTROL_HASEL_Max (0x1UL)    /*!< Max enumerator value of HASEL field.                                 */
  #define VPR_DEBUGIF_DMCONTROL_HASEL_Single (0x0UL) /*!< Single hart selected.                                                */
  #define VPR_DEBUGIF_DMCONTROL_HASEL_Multiple (0x1UL) /*!< Multiple harts selected                                            */

