NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* VAL @Bits 0..31 : Machine Instruction Counter (Upper part) value */
  #define VPRCSR_MINSTRETH_VAL_Pos (0UL)             /*!< Position of VAL field.                                               */
  #define VPRCSR_MINSTRETH_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MINSTRETH_VAL_Pos) /*!< Bit mask of VAL field.                      */


/**
  * @brief UCYCLE [VPRCSR_UCYCLE] User Cycle Counter
  */
  #define VPRCSR_UCYCLE (0x00000C00ul)
  #define VPRCSR_UCYCLE_ResetValue (0x00000000UL)    /*!< Reset value of UCYCLE register.                                      */

/* VAL @Bits 0..31 : User Cycle Counter value */
  #define VPRCSR_UCYCLE_VAL_Pos (0UL)                /*!< Position of VAL field.                                               */
  #define VPRCSR_UCYCLE_VAL_Msk (0xFFFFFFFFUL << VPRCSR_UCYCLE_VAL_Pos) /*!< Bit mask of VAL field.                            */


/**
  * @brief UINSTRET [VPRCSR_UINSTRET] User Instruction Counter
  */
  #define VPRCSR_UINSTRET (0x00000C02ul)
  #define VPRCSR_UINSTRET_ResetValue (0x00000000UL)  /*!< Reset value of UINSTRET register.                                    */

/* VAL @Bits 0..31 : User Instruction Counter value */
  #define VPRCSR_UINSTRET_VAL_Pos (0UL)              /*!< Position of VAL field.                                               */
  #define VPRCSR_UINSTRET_VAL_Msk (0xFFFFFFFFUL << VPRCSR_UINSTRET_VAL_Pos) /*!< Bit mask of VAL field.                        */


/**
  * @brief UCYCLEH [VPRCSR_UCYCLEH] User Cycle Counter (Upper part)
  */
  #define VPRCSR_UCYCLEH (0x00000C80ul)
  #define VPRCSR_UCYCLEH_ResetValue (0x00000000UL)   /*!< Reset value of UCYCLEH register.                                     */

/* VAL @Bits 0..31 : User Cycle Counter value */
  #define VPRCSR_UCYCLEH_VAL_Pos (0UL)               /*!< Position of VAL field.                                               */
  #define VPRCSR_UCYCLEH_VAL_Msk (0xFFFFFFFFUL << VPRCSR_UCYCLEH_VAL_Pos) /*!< Bit mask of VAL field.                          */


/**
  * @brief UINSTRETH [VPRCSR_UINSTRETH] User Instruction Counter (Upper part)
  */
  #define VPRCSR_UINSTRETH (0x00000C82ul)
  #define VPRCSR_UINSTRETH_ResetValue (0x00000000UL) /*!< Reset value of UINSTRETH register.                                   */

/* VAL @Bits 0..31 : User Instruction Counter (Upper part) value */
  #define VPRCSR_UINSTRETH_VAL_Pos (0UL)             /*!< Position of VAL field.                                               */
  #define VPRCSR_UINSTRETH_VAL_Msk (0xFFFFFFFFUL << VPRCSR_UINSTRETH_VAL_Pos) /*!< Bit mask of VAL field.                      */


/**
  * @brief MVENDORID [VPRCSR_MVENDORID] Machine Vendor ID
  */
  #define VPRCSR_MVENDORID (0x00000F11ul)
  #define VPRCSR_MVENDORID_ResetValue (0x00000144UL) /*!< Reset value of MVENDORID register.                                   */

/* OFFSET @Bits 0..6 : MVENDORID encodes the final byte in the Offset field, discarding the parity bit */
  #define VPRCSR_MVENDORID_OFFSET_Pos (0UL)          /*!< Position of OFFSET field.                                            */
  #define VPRCSR_MVENDORID_OFFSET_Msk (0x7FUL << VPRCSR_MVENDORID_OFFSET_Pos) /*!< Bit mask of OFFSET field.                   */

/* BANK @Bits 7..31 : MVENDORID encodes the number of one-byte continuation codes in the Bank field */
  #define VPRCSR_MVENDORID_BANK_Pos (7UL)            /*!< Position of BANK field.                                              */
  #define VPRCSR_MVENDORID_BANK_Msk (0x1FFFFFFUL << VPRCSR_MVENDORID_BANK_Pos) /*!< Bit mask of BANK field.                    */


/**
  * @brief MARCHID [VPRCSR_MARCHID] Machine Architecture ID
  */
  #define VPRCSR_MARCHID (0x00000F12ul)
  #define VPRCSR_MARCHID_ResetValue (0x8000006EUL)   /*!< Reset value of MARCHID register.                                     */

/* MULDIV @Bits 0..1 : Indicates the MULDIV parameter option */
  #define VPRCSR_MARCHID_MULDIV_Pos (0UL)            /*!< Position of MULDIV field.                                            */
  #define VPRCSR_MARCHID_MULDIV_Msk (0x3UL << VPRCSR_MARCHID_MULDIV_Pos) /*!< Bit mask of MULDIV field.                        */

/* HIBERNATE @Bit 2 : Indicates the POWEROFFSLEEP parameter option */
  #define VPRCSR_MARCHID_HIBERNATE_Pos (2UL)         /*!< Position of HIBERNATE field.                                         */
  #define VPRCSR_MARCHID_HIBERNATE_Msk (0x1UL << VPRCSR_MARCHID_HIBERNATE_Pos) /*!< Bit mask of HIBERNATE field.               */

/* DBG @Bit 3 : Indicates the DBG parameter option */
  #define VPRCSR_MARCHID_DBG_Pos (3UL)               /*!< Position of DBG field.                                               */
  #define VPRCSR_MARCHID_DBG_Msk (0x1UL << VPRCSR_MARCHID_DBG_Pos) /*!< Bit mask of DBG field.                                 */

/* REMAP @Bit 4 : Indicates the REMAP parameter option */
  #define VPRCSR_MARCHID_REMAP_Pos (4UL)             /*!< Position of REMAP field.                                             */
  #define VPRCSR_MARCHID_REMAP_Msk (0x1UL << VPRCSR_MARCHID_REMAP_Pos) /*!< Bit mask of REMAP field.                           */

/* BUSWIDTH @Bit 5 : Indicates the BUS_WIDTH parameter option */
  #define VPRCSR_MARCHID_BUSWIDTH_Pos (5UL)          /*!< Position of BUSWIDTH field.                                          */
  #define VPRCSR_MARCHID_BUSWIDTH_Msk (0x1UL << VPRCSR_MARCHID_BUSWIDTH_Pos) /*!< Bit mask of BUSWIDTH field.                  */

/* BKPT @Bits 6..9 : Indicates the BKPT parameter option */
  #define VPRCSR_MARCHID_BKPT_Pos (6UL)              /*!< Position of BKPT field.                                              */
  #define VPRCSR_MARCHID_BKPT_Msk (0xFUL << VPRCSR_MARCHID_BKPT_Pos) /*!< Bit mask of BKPT field.                              */

/* CACHE @Bit 10 : Indicates that the CACHE is present */
  #define VPRCSR_MARCHID_CACHE_Pos (10UL)            /*!< Position of CACHE field.                                             */
  #define VPRCSR_MARCHID_CACHE_Msk (0x1UL << VPRCSR_MARCHID_CACHE_Pos) /*!< Bit mask of CACHE field.                           */

/* CACHEEXTRATAGBUF @Bits 11..13 : Indicates the number of extra TAG buffers in CACHE */
  #define VPRCSR_MARCHID_CACHEEXTRATAGBUF_Pos (11UL) /*!< Position of CACHEEXTRATAGBUF field.                                  */
  #define VPRCSR_MARCHID_CACHEEXTRATAGBUF_Msk (0x7UL << VPRCSR_MARCHID_CACHEEXTRATAGBUF_Pos) /*!< Bit mask of CACHEEXTRATAGBUF
                                                                            field.*/

/* RETAINED @Bit 16 : Indicates the RETAINED parameter option */
  #define VPRCSR_MARCHID_RETAINED_Pos (16UL)         /*!< Position of RETAINED field.                                          */
  #define VPRCSR_MARCHID_RETAINED_Msk (0x1UL << VPRCSR_MARCHID_RETAINED_Pos) /*!< Bit mask of RETAINED field.                  */

