NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN8_Pos (8UL)          /*!< Position of PIN8 field.                                              */
  #define VPRCSR_NORDIC_OUTB_PIN8_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN8_Pos) /*!< Bit mask of PIN8 field.                      */
  #define VPRCSR_NORDIC_OUTB_PIN8_Min (0x0UL)        /*!< Min enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_OUTB_PIN8_Max (0x1UL)        /*!< Max enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_OUTB_PIN8_LOW (0x0UL)        /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN8_HIGH (0x1UL)       /*!< Pin driver is high                                                   */

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN9_Pos (9UL)          /*!< Position of PIN9 field.                                              */
  #define VPRCSR_NORDIC_OUTB_PIN9_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN9_Pos) /*!< Bit mask of PIN9 field.                      */
  #define VPRCSR_NORDIC_OUTB_PIN9_Min (0x0UL)        /*!< Min enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_OUTB_PIN9_Max (0x1UL)        /*!< Max enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_OUTB_PIN9_LOW (0x0UL)        /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN9_HIGH (0x1UL)       /*!< Pin driver is high                                                   */

/* PIN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN10_Pos (10UL)        /*!< Position of PIN10 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN10_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN10_Pos) /*!< Bit mask of PIN10 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN10_Min (0x0UL)       /*!< Min enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN10_Max (0x1UL)       /*!< Max enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN10_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN10_HIGH (0x1UL)      /*!< Pin driver is high                                                   */

/* PIN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN11_Pos (11UL)        /*!< Position of PIN11 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN11_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN11_Pos) /*!< Bit mask of PIN11 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN11_Min (0x0UL)       /*!< Min enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN11_Max (0x1UL)       /*!< Max enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN11_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN11_HIGH (0x1UL)      /*!< Pin driver is high                                                   */

/* PIN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN12_Pos (12UL)        /*!< Position of PIN12 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN12_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN12_Pos) /*!< Bit mask of PIN12 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN12_Min (0x0UL)       /*!< Min enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN12_Max (0x1UL)       /*!< Max enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN12_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN12_HIGH (0x1UL)      /*!< Pin driver is high                                                   */

/* PIN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN13_Pos (13UL)        /*!< Position of PIN13 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN13_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN13_Pos) /*!< Bit mask of PIN13 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN13_Min (0x0UL)       /*!< Min enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN13_Max (0x1UL)       /*!< Max enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN13_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN13_HIGH (0x1UL)      /*!< Pin driver is high                                                   */

/* PIN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN14_Pos (14UL)        /*!< Position of PIN14 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN14_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN14_Pos) /*!< Bit mask of PIN14 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN14_Min (0x0UL)       /*!< Min enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN14_Max (0x1UL)       /*!< Max enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN14_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN14_HIGH (0x1UL)      /*!< Pin driver is high                                                   */

/* PIN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN15_Pos (15UL)        /*!< Position of PIN15 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN15_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN15_Pos) /*!< Bit mask of PIN15 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN15_Min (0x0UL)       /*!< Min enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN15_Max (0x1UL)       /*!< Max enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN15_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN15_HIGH (0x1UL)      /*!< Pin driver is high                                                   */

/* PIN16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN16_Pos (16UL)        /*!< Position of PIN16 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN16_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN16_Pos) /*!< Bit mask of PIN16 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN16_Min (0x0UL)       /*!< Min enumerator value of PIN16 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN16_Max (0x1UL)       /*!< Max enumerator value of PIN16 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN16_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN16_HIGH (0x1UL)      /*!< Pin driver is high                                                   */

