NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l05_types.h
/* PIN8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN8_Pos (8UL)       /*!< Position of PIN8 field.                                              */
  #define VPRCSR_NORDIC_DIRBTGL_PIN8_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN8_Pos) /*!< Bit mask of PIN8 field.                */
  #define VPRCSR_NORDIC_DIRBTGL_PIN8_Min (0x0UL)     /*!< Min enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_DIRBTGL_PIN8_Max (0x1UL)     /*!< Max enumerator value of PIN8 field.                                  */
  #define VPRCSR_NORDIC_DIRBTGL_PIN8_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                              */
  #define VPRCSR_NORDIC_DIRBTGL_PIN8_TOGGLE (0x1UL)  /*!< Pin is toggled                                                       */

/* PIN9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN9_Pos (9UL)       /*!< Position of PIN9 field.                                              */
  #define VPRCSR_NORDIC_DIRBTGL_PIN9_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN9_Pos) /*!< Bit mask of PIN9 field.                */
  #define VPRCSR_NORDIC_DIRBTGL_PIN9_Min (0x0UL)     /*!< Min enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_DIRBTGL_PIN9_Max (0x1UL)     /*!< Max enumerator value of PIN9 field.                                  */
  #define VPRCSR_NORDIC_DIRBTGL_PIN9_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                              */
  #define VPRCSR_NORDIC_DIRBTGL_PIN9_TOGGLE (0x1UL)  /*!< Pin is toggled                                                       */

/* PIN10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN10_Pos (10UL)     /*!< Position of PIN10 field.                                             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN10_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN10_Pos) /*!< Bit mask of PIN10 field.             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN10_Min (0x0UL)    /*!< Min enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_DIRBTGL_PIN10_Max (0x1UL)    /*!< Max enumerator value of PIN10 field.                                 */
  #define VPRCSR_NORDIC_DIRBTGL_PIN10_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN10_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN11_Pos (11UL)     /*!< Position of PIN11 field.                                             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN11_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN11_Pos) /*!< Bit mask of PIN11 field.             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN11_Min (0x0UL)    /*!< Min enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_DIRBTGL_PIN11_Max (0x1UL)    /*!< Max enumerator value of PIN11 field.                                 */
  #define VPRCSR_NORDIC_DIRBTGL_PIN11_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN11_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN12_Pos (12UL)     /*!< Position of PIN12 field.                                             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN12_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN12_Pos) /*!< Bit mask of PIN12 field.             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN12_Min (0x0UL)    /*!< Min enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_DIRBTGL_PIN12_Max (0x1UL)    /*!< Max enumerator value of PIN12 field.                                 */
  #define VPRCSR_NORDIC_DIRBTGL_PIN12_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN12_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN13_Pos (13UL)     /*!< Position of PIN13 field.                                             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN13_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN13_Pos) /*!< Bit mask of PIN13 field.             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN13_Min (0x0UL)    /*!< Min enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_DIRBTGL_PIN13_Max (0x1UL)    /*!< Max enumerator value of PIN13 field.                                 */
  #define VPRCSR_NORDIC_DIRBTGL_PIN13_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN13_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN14_Pos (14UL)     /*!< Position of PIN14 field.                                             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN14_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN14_Pos) /*!< Bit mask of PIN14 field.             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN14_Min (0x0UL)    /*!< Min enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_DIRBTGL_PIN14_Max (0x1UL)    /*!< Max enumerator value of PIN14 field.                                 */
  #define VPRCSR_NORDIC_DIRBTGL_PIN14_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN14_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN15_Pos (15UL)     /*!< Position of PIN15 field.                                             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN15_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN15_Pos) /*!< Bit mask of PIN15 field.             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN15_Min (0x0UL)    /*!< Min enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_DIRBTGL_PIN15_Max (0x1UL)    /*!< Max enumerator value of PIN15 field.                                 */
  #define VPRCSR_NORDIC_DIRBTGL_PIN15_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_DIRBTGL_PIN15_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */


/**
  * @brief DIROUTTGL [VPRCSR_NORDIC_DIROUTTGL] DIROUT Toggle
  */
  #define VPRCSR_NORDIC_DIROUTTGL (0x00000BD4ul)
  #define VPRCSR_NORDIC_DIROUTTGL_ResetValue (0x00000000UL) /*!< Reset value of DIROUTTGL register.                            */

/* OUT0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT0_Pos (0UL)     /*!< Position of OUT0 field.                                              */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT0_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_OUT0_Pos) /*!< Bit mask of OUT0 field.            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT0_Min (0x0UL)   /*!< Min enumerator value of OUT0 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT0_Max (0x1UL)   /*!< Max enumerator value of OUT0 field.                                  */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT0_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                            */
  #define VPRCSR_NORDIC_DIROUTTGL_OUT0_TOGGLE (0x1UL) /*!< Pin is toggled                                                      */

